MikroElektronika/core_packages/PIC/XC8/def/PIC18F85J94/mcu.h
// Register: RPINR0_1
#define RPINR0_1 RPINR0_1
extern volatile unsigned char           RPINR0_1            __at(0xE2A);
#ifndef _LIB_BUILD
asm("RPINR0_1 equ 0E2Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned U1RXR                  :4;
        unsigned U1TXR                  :4;
    };
    struct {
        unsigned U1RXR0                 :1;
        unsigned U1RXR1                 :1;
        unsigned U1RXR2                 :1;
        unsigned U1RXR3                 :1;
        unsigned U1TXR0                 :1;
        unsigned U1TXR1                 :1;
        unsigned U1TXR2                 :1;
        unsigned U1TXR3                 :1;
    };
} RPINR0_1bits_t;
extern volatile RPINR0_1bits_t RPINR0_1bits __at(0xE2A);
// bitfield macros
#define _RPINR0_1_U1RXR_POSN                                0x0
#define _RPINR0_1_U1RXR_POSITION                            0x0
#define _RPINR0_1_U1RXR_SIZE                                0x4
#define _RPINR0_1_U1RXR_LENGTH                              0x4
#define _RPINR0_1_U1RXR_MASK                                0xF
#define _RPINR0_1_U1TXR_POSN                                0x4
#define _RPINR0_1_U1TXR_POSITION                            0x4
#define _RPINR0_1_U1TXR_SIZE                                0x4
#define _RPINR0_1_U1TXR_LENGTH                              0x4
#define _RPINR0_1_U1TXR_MASK                                0xF0
#define _RPINR0_1_U1RXR0_POSN                               0x0
#define _RPINR0_1_U1RXR0_POSITION                           0x0
#define _RPINR0_1_U1RXR0_SIZE                               0x1
#define _RPINR0_1_U1RXR0_LENGTH                             0x1
#define _RPINR0_1_U1RXR0_MASK                               0x1
#define _RPINR0_1_U1RXR1_POSN                               0x1
#define _RPINR0_1_U1RXR1_POSITION                           0x1
#define _RPINR0_1_U1RXR1_SIZE                               0x1
#define _RPINR0_1_U1RXR1_LENGTH                             0x1
#define _RPINR0_1_U1RXR1_MASK                               0x2
#define _RPINR0_1_U1RXR2_POSN                               0x2
#define _RPINR0_1_U1RXR2_POSITION                           0x2
#define _RPINR0_1_U1RXR2_SIZE                               0x1
#define _RPINR0_1_U1RXR2_LENGTH                             0x1
#define _RPINR0_1_U1RXR2_MASK                               0x4
#define _RPINR0_1_U1RXR3_POSN                               0x3
#define _RPINR0_1_U1RXR3_POSITION                           0x3
#define _RPINR0_1_U1RXR3_SIZE                               0x1
#define _RPINR0_1_U1RXR3_LENGTH                             0x1
#define _RPINR0_1_U1RXR3_MASK                               0x8
#define _RPINR0_1_U1TXR0_POSN                               0x4
#define _RPINR0_1_U1TXR0_POSITION                           0x4
#define _RPINR0_1_U1TXR0_SIZE                               0x1
#define _RPINR0_1_U1TXR0_LENGTH                             0x1
#define _RPINR0_1_U1TXR0_MASK                               0x10
#define _RPINR0_1_U1TXR1_POSN                               0x5
#define _RPINR0_1_U1TXR1_POSITION                           0x5
#define _RPINR0_1_U1TXR1_SIZE                               0x1
#define _RPINR0_1_U1TXR1_LENGTH                             0x1
#define _RPINR0_1_U1TXR1_MASK                               0x20
#define _RPINR0_1_U1TXR2_POSN                               0x6
#define _RPINR0_1_U1TXR2_POSITION                           0x6
#define _RPINR0_1_U1TXR2_SIZE                               0x1
#define _RPINR0_1_U1TXR2_LENGTH                             0x1
#define _RPINR0_1_U1TXR2_MASK                               0x40
#define _RPINR0_1_U1TXR3_POSN                               0x7
#define _RPINR0_1_U1TXR3_POSITION                           0x7
#define _RPINR0_1_U1TXR3_SIZE                               0x1
#define _RPINR0_1_U1TXR3_LENGTH                             0x1
#define _RPINR0_1_U1TXR3_MASK                               0x80

// Register: RPINR2_3
#define RPINR2_3 RPINR2_3
extern volatile unsigned char           RPINR2_3            __at(0xE2B);
#ifndef _LIB_BUILD
asm("RPINR2_3 equ 0E2Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned U2RXR                  :4;
        unsigned U2TXR                  :4;
    };
    struct {
        unsigned U2RXR0                 :1;
        unsigned U2RXR1                 :1;
        unsigned U2RXR2                 :1;
        unsigned U2RXR3                 :1;
        unsigned U2TXR0                 :1;
        unsigned U2TXR1                 :1;
        unsigned U2TXR2                 :1;
        unsigned U2TXR3                 :1;
    };
} RPINR2_3bits_t;
extern volatile RPINR2_3bits_t RPINR2_3bits __at(0xE2B);
// bitfield macros
#define _RPINR2_3_U2RXR_POSN                                0x0
#define _RPINR2_3_U2RXR_POSITION                            0x0
#define _RPINR2_3_U2RXR_SIZE                                0x4
#define _RPINR2_3_U2RXR_LENGTH                              0x4
#define _RPINR2_3_U2RXR_MASK                                0xF
#define _RPINR2_3_U2TXR_POSN                                0x4
#define _RPINR2_3_U2TXR_POSITION                            0x4
#define _RPINR2_3_U2TXR_SIZE                                0x4
#define _RPINR2_3_U2TXR_LENGTH                              0x4
#define _RPINR2_3_U2TXR_MASK                                0xF0
#define _RPINR2_3_U2RXR0_POSN                               0x0
#define _RPINR2_3_U2RXR0_POSITION                           0x0
#define _RPINR2_3_U2RXR0_SIZE                               0x1
#define _RPINR2_3_U2RXR0_LENGTH                             0x1
#define _RPINR2_3_U2RXR0_MASK                               0x1
#define _RPINR2_3_U2RXR1_POSN                               0x1
#define _RPINR2_3_U2RXR1_POSITION                           0x1
#define _RPINR2_3_U2RXR1_SIZE                               0x1
#define _RPINR2_3_U2RXR1_LENGTH                             0x1
#define _RPINR2_3_U2RXR1_MASK                               0x2
#define _RPINR2_3_U2RXR2_POSN                               0x2
#define _RPINR2_3_U2RXR2_POSITION                           0x2
#define _RPINR2_3_U2RXR2_SIZE                               0x1
#define _RPINR2_3_U2RXR2_LENGTH                             0x1
#define _RPINR2_3_U2RXR2_MASK                               0x4
#define _RPINR2_3_U2RXR3_POSN                               0x3
#define _RPINR2_3_U2RXR3_POSITION                           0x3
#define _RPINR2_3_U2RXR3_SIZE                               0x1
#define _RPINR2_3_U2RXR3_LENGTH                             0x1
#define _RPINR2_3_U2RXR3_MASK                               0x8
#define _RPINR2_3_U2TXR0_POSN                               0x4
#define _RPINR2_3_U2TXR0_POSITION                           0x4
#define _RPINR2_3_U2TXR0_SIZE                               0x1
#define _RPINR2_3_U2TXR0_LENGTH                             0x1
#define _RPINR2_3_U2TXR0_MASK                               0x10
#define _RPINR2_3_U2TXR1_POSN                               0x5
#define _RPINR2_3_U2TXR1_POSITION                           0x5
#define _RPINR2_3_U2TXR1_SIZE                               0x1
#define _RPINR2_3_U2TXR1_LENGTH                             0x1
#define _RPINR2_3_U2TXR1_MASK                               0x20
#define _RPINR2_3_U2TXR2_POSN                               0x6
#define _RPINR2_3_U2TXR2_POSITION                           0x6
#define _RPINR2_3_U2TXR2_SIZE                               0x1
#define _RPINR2_3_U2TXR2_LENGTH                             0x1
#define _RPINR2_3_U2TXR2_MASK                               0x40
#define _RPINR2_3_U2TXR3_POSN                               0x7
#define _RPINR2_3_U2TXR3_POSITION                           0x7
#define _RPINR2_3_U2TXR3_SIZE                               0x1
#define _RPINR2_3_U2TXR3_LENGTH                             0x1
#define _RPINR2_3_U2TXR3_MASK                               0x80

// Register: RPINR4_5
#define RPINR4_5 RPINR4_5
extern volatile unsigned char           RPINR4_5            __at(0xE2C);
#ifndef _LIB_BUILD
asm("RPINR4_5 equ 0E2Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned U3RXR                  :4;
        unsigned U3TXR                  :4;
    };
    struct {
        unsigned U3RXR0                 :1;
        unsigned U3RXR1                 :1;
        unsigned U3RXR2                 :1;
        unsigned U3RXR3                 :1;
        unsigned U3TXR0                 :1;
        unsigned U3TXR1                 :1;
        unsigned U3TXR2                 :1;
        unsigned U3TXR3                 :1;
    };
} RPINR4_5bits_t;
extern volatile RPINR4_5bits_t RPINR4_5bits __at(0xE2C);
// bitfield macros
#define _RPINR4_5_U3RXR_POSN                                0x0
#define _RPINR4_5_U3RXR_POSITION                            0x0
#define _RPINR4_5_U3RXR_SIZE                                0x4
#define _RPINR4_5_U3RXR_LENGTH                              0x4
#define _RPINR4_5_U3RXR_MASK                                0xF
#define _RPINR4_5_U3TXR_POSN                                0x4
#define _RPINR4_5_U3TXR_POSITION                            0x4
#define _RPINR4_5_U3TXR_SIZE                                0x4
#define _RPINR4_5_U3TXR_LENGTH                              0x4
#define _RPINR4_5_U3TXR_MASK                                0xF0
#define _RPINR4_5_U3RXR0_POSN                               0x0
#define _RPINR4_5_U3RXR0_POSITION                           0x0
#define _RPINR4_5_U3RXR0_SIZE                               0x1
#define _RPINR4_5_U3RXR0_LENGTH                             0x1
#define _RPINR4_5_U3RXR0_MASK                               0x1
#define _RPINR4_5_U3RXR1_POSN                               0x1
#define _RPINR4_5_U3RXR1_POSITION                           0x1
#define _RPINR4_5_U3RXR1_SIZE                               0x1
#define _RPINR4_5_U3RXR1_LENGTH                             0x1
#define _RPINR4_5_U3RXR1_MASK                               0x2
#define _RPINR4_5_U3RXR2_POSN                               0x2
#define _RPINR4_5_U3RXR2_POSITION                           0x2
#define _RPINR4_5_U3RXR2_SIZE                               0x1
#define _RPINR4_5_U3RXR2_LENGTH                             0x1
#define _RPINR4_5_U3RXR2_MASK                               0x4
#define _RPINR4_5_U3RXR3_POSN                               0x3
#define _RPINR4_5_U3RXR3_POSITION                           0x3
#define _RPINR4_5_U3RXR3_SIZE                               0x1
#define _RPINR4_5_U3RXR3_LENGTH                             0x1
#define _RPINR4_5_U3RXR3_MASK                               0x8
#define _RPINR4_5_U3TXR0_POSN                               0x4
#define _RPINR4_5_U3TXR0_POSITION                           0x4
#define _RPINR4_5_U3TXR0_SIZE                               0x1
#define _RPINR4_5_U3TXR0_LENGTH                             0x1
#define _RPINR4_5_U3TXR0_MASK                               0x10
#define _RPINR4_5_U3TXR1_POSN                               0x5
#define _RPINR4_5_U3TXR1_POSITION                           0x5
#define _RPINR4_5_U3TXR1_SIZE                               0x1
#define _RPINR4_5_U3TXR1_LENGTH                             0x1
#define _RPINR4_5_U3TXR1_MASK                               0x20
#define _RPINR4_5_U3TXR2_POSN                               0x6
#define _RPINR4_5_U3TXR2_POSITION                           0x6
#define _RPINR4_5_U3TXR2_SIZE                               0x1
#define _RPINR4_5_U3TXR2_LENGTH                             0x1
#define _RPINR4_5_U3TXR2_MASK                               0x40
#define _RPINR4_5_U3TXR3_POSN                               0x7
#define _RPINR4_5_U3TXR3_POSITION                           0x7
#define _RPINR4_5_U3TXR3_SIZE                               0x1
#define _RPINR4_5_U3TXR3_LENGTH                             0x1
#define _RPINR4_5_U3TXR3_MASK                               0x80

// Register: RPINR6_7
#define RPINR6_7 RPINR6_7
extern volatile unsigned char           RPINR6_7            __at(0xE2D);
#ifndef _LIB_BUILD
asm("RPINR6_7 equ 0E2Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned U4RXR                  :4;
        unsigned U4TXR                  :4;
    };
    struct {
        unsigned U4RXR0                 :1;
        unsigned U4RXR1                 :1;
        unsigned U4RXR2                 :1;
        unsigned U4RXR3                 :1;
        unsigned U4TXR0                 :1;
        unsigned U4TXR1                 :1;
        unsigned U4TXR2                 :1;
        unsigned U4TXR3                 :1;
    };
} RPINR6_7bits_t;
extern volatile RPINR6_7bits_t RPINR6_7bits __at(0xE2D);
// bitfield macros
#define _RPINR6_7_U4RXR_POSN                                0x0
#define _RPINR6_7_U4RXR_POSITION                            0x0
#define _RPINR6_7_U4RXR_SIZE                                0x4
#define _RPINR6_7_U4RXR_LENGTH                              0x4
#define _RPINR6_7_U4RXR_MASK                                0xF
#define _RPINR6_7_U4TXR_POSN                                0x4
#define _RPINR6_7_U4TXR_POSITION                            0x4
#define _RPINR6_7_U4TXR_SIZE                                0x4
#define _RPINR6_7_U4TXR_LENGTH                              0x4
#define _RPINR6_7_U4TXR_MASK                                0xF0
#define _RPINR6_7_U4RXR0_POSN                               0x0
#define _RPINR6_7_U4RXR0_POSITION                           0x0
#define _RPINR6_7_U4RXR0_SIZE                               0x1
#define _RPINR6_7_U4RXR0_LENGTH                             0x1
#define _RPINR6_7_U4RXR0_MASK                               0x1
#define _RPINR6_7_U4RXR1_POSN                               0x1
#define _RPINR6_7_U4RXR1_POSITION                           0x1
#define _RPINR6_7_U4RXR1_SIZE                               0x1
#define _RPINR6_7_U4RXR1_LENGTH                             0x1
#define _RPINR6_7_U4RXR1_MASK                               0x2
#define _RPINR6_7_U4RXR2_POSN                               0x2
#define _RPINR6_7_U4RXR2_POSITION                           0x2
#define _RPINR6_7_U4RXR2_SIZE                               0x1
#define _RPINR6_7_U4RXR2_LENGTH                             0x1
#define _RPINR6_7_U4RXR2_MASK                               0x4
#define _RPINR6_7_U4RXR3_POSN                               0x3
#define _RPINR6_7_U4RXR3_POSITION                           0x3
#define _RPINR6_7_U4RXR3_SIZE                               0x1
#define _RPINR6_7_U4RXR3_LENGTH                             0x1
#define _RPINR6_7_U4RXR3_MASK                               0x8
#define _RPINR6_7_U4TXR0_POSN                               0x4
#define _RPINR6_7_U4TXR0_POSITION                           0x4
#define _RPINR6_7_U4TXR0_SIZE                               0x1
#define _RPINR6_7_U4TXR0_LENGTH                             0x1
#define _RPINR6_7_U4TXR0_MASK                               0x10
#define _RPINR6_7_U4TXR1_POSN                               0x5
#define _RPINR6_7_U4TXR1_POSITION                           0x5
#define _RPINR6_7_U4TXR1_SIZE                               0x1
#define _RPINR6_7_U4TXR1_LENGTH                             0x1
#define _RPINR6_7_U4TXR1_MASK                               0x20
#define _RPINR6_7_U4TXR2_POSN                               0x6
#define _RPINR6_7_U4TXR2_POSITION                           0x6
#define _RPINR6_7_U4TXR2_SIZE                               0x1
#define _RPINR6_7_U4TXR2_LENGTH                             0x1
#define _RPINR6_7_U4TXR2_MASK                               0x40
#define _RPINR6_7_U4TXR3_POSN                               0x7
#define _RPINR6_7_U4TXR3_POSITION                           0x7
#define _RPINR6_7_U4TXR3_SIZE                               0x1
#define _RPINR6_7_U4TXR3_LENGTH                             0x1
#define _RPINR6_7_U4TXR3_MASK                               0x80

// Register: RPINR8_9
#define RPINR8_9 RPINR8_9
extern volatile unsigned char           RPINR8_9            __at(0xE2E);
#ifndef _LIB_BUILD
asm("RPINR8_9 equ 0E2Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SCK1R                  :4;
        unsigned SDI1R                  :4;
    };
    struct {
        unsigned SCK1R0                 :1;
        unsigned SCK1R1                 :1;
        unsigned SCK1R2                 :1;
        unsigned SCK1R3                 :1;
        unsigned SDI1R0                 :1;
        unsigned SDI1R1                 :1;
        unsigned SDI1R2                 :1;
        unsigned SDI1R3                 :1;
    };
} RPINR8_9bits_t;
extern volatile RPINR8_9bits_t RPINR8_9bits __at(0xE2E);
// bitfield macros
#define _RPINR8_9_SCK1R_POSN                                0x0
#define _RPINR8_9_SCK1R_POSITION                            0x0
#define _RPINR8_9_SCK1R_SIZE                                0x4
#define _RPINR8_9_SCK1R_LENGTH                              0x4
#define _RPINR8_9_SCK1R_MASK                                0xF
#define _RPINR8_9_SDI1R_POSN                                0x4
#define _RPINR8_9_SDI1R_POSITION                            0x4
#define _RPINR8_9_SDI1R_SIZE                                0x4
#define _RPINR8_9_SDI1R_LENGTH                              0x4
#define _RPINR8_9_SDI1R_MASK                                0xF0
#define _RPINR8_9_SCK1R0_POSN                               0x0
#define _RPINR8_9_SCK1R0_POSITION                           0x0
#define _RPINR8_9_SCK1R0_SIZE                               0x1
#define _RPINR8_9_SCK1R0_LENGTH                             0x1
#define _RPINR8_9_SCK1R0_MASK                               0x1
#define _RPINR8_9_SCK1R1_POSN                               0x1
#define _RPINR8_9_SCK1R1_POSITION                           0x1
#define _RPINR8_9_SCK1R1_SIZE                               0x1
#define _RPINR8_9_SCK1R1_LENGTH                             0x1
#define _RPINR8_9_SCK1R1_MASK                               0x2
#define _RPINR8_9_SCK1R2_POSN                               0x2
#define _RPINR8_9_SCK1R2_POSITION                           0x2
#define _RPINR8_9_SCK1R2_SIZE                               0x1
#define _RPINR8_9_SCK1R2_LENGTH                             0x1
#define _RPINR8_9_SCK1R2_MASK                               0x4
#define _RPINR8_9_SCK1R3_POSN                               0x3
#define _RPINR8_9_SCK1R3_POSITION                           0x3
#define _RPINR8_9_SCK1R3_SIZE                               0x1
#define _RPINR8_9_SCK1R3_LENGTH                             0x1
#define _RPINR8_9_SCK1R3_MASK                               0x8
#define _RPINR8_9_SDI1R0_POSN                               0x4
#define _RPINR8_9_SDI1R0_POSITION                           0x4
#define _RPINR8_9_SDI1R0_SIZE                               0x1
#define _RPINR8_9_SDI1R0_LENGTH                             0x1
#define _RPINR8_9_SDI1R0_MASK                               0x10
#define _RPINR8_9_SDI1R1_POSN                               0x5
#define _RPINR8_9_SDI1R1_POSITION                           0x5
#define _RPINR8_9_SDI1R1_SIZE                               0x1
#define _RPINR8_9_SDI1R1_LENGTH                             0x1
#define _RPINR8_9_SDI1R1_MASK                               0x20
#define _RPINR8_9_SDI1R2_POSN                               0x6
#define _RPINR8_9_SDI1R2_POSITION                           0x6
#define _RPINR8_9_SDI1R2_SIZE                               0x1
#define _RPINR8_9_SDI1R2_LENGTH                             0x1
#define _RPINR8_9_SDI1R2_MASK                               0x40
#define _RPINR8_9_SDI1R3_POSN                               0x7
#define _RPINR8_9_SDI1R3_POSITION                           0x7
#define _RPINR8_9_SDI1R3_SIZE                               0x1
#define _RPINR8_9_SDI1R3_LENGTH                             0x1
#define _RPINR8_9_SDI1R3_MASK                               0x80

// Register: RPINR10_11
#define RPINR10_11 RPINR10_11
extern volatile unsigned char           RPINR10_11          __at(0xE2F);
#ifndef _LIB_BUILD
asm("RPINR10_11 equ 0E2Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SS1R                   :4;
        unsigned SCK2R                  :4;
    };
    struct {
        unsigned SS1R0                  :1;
        unsigned SS1R1                  :1;
        unsigned SS1R2                  :1;
        unsigned SS1R3                  :1;
        unsigned SCK2R0                 :1;
        unsigned SCK2R1                 :1;
        unsigned SCK2R2                 :1;
        unsigned SCK2R3                 :1;
    };
} RPINR10_11bits_t;
extern volatile RPINR10_11bits_t RPINR10_11bits __at(0xE2F);
// bitfield macros
#define _RPINR10_11_SS1R_POSN                               0x0
#define _RPINR10_11_SS1R_POSITION                           0x0
#define _RPINR10_11_SS1R_SIZE                               0x4
#define _RPINR10_11_SS1R_LENGTH                             0x4
#define _RPINR10_11_SS1R_MASK                               0xF
#define _RPINR10_11_SCK2R_POSN                              0x4
#define _RPINR10_11_SCK2R_POSITION                          0x4
#define _RPINR10_11_SCK2R_SIZE                              0x4
#define _RPINR10_11_SCK2R_LENGTH                            0x4
#define _RPINR10_11_SCK2R_MASK                              0xF0
#define _RPINR10_11_SS1R0_POSN                              0x0
#define _RPINR10_11_SS1R0_POSITION                          0x0
#define _RPINR10_11_SS1R0_SIZE                              0x1
#define _RPINR10_11_SS1R0_LENGTH                            0x1
#define _RPINR10_11_SS1R0_MASK                              0x1
#define _RPINR10_11_SS1R1_POSN                              0x1
#define _RPINR10_11_SS1R1_POSITION                          0x1
#define _RPINR10_11_SS1R1_SIZE                              0x1
#define _RPINR10_11_SS1R1_LENGTH                            0x1
#define _RPINR10_11_SS1R1_MASK                              0x2
#define _RPINR10_11_SS1R2_POSN                              0x2
#define _RPINR10_11_SS1R2_POSITION                          0x2
#define _RPINR10_11_SS1R2_SIZE                              0x1
#define _RPINR10_11_SS1R2_LENGTH                            0x1
#define _RPINR10_11_SS1R2_MASK                              0x4
#define _RPINR10_11_SS1R3_POSN                              0x3
#define _RPINR10_11_SS1R3_POSITION                          0x3
#define _RPINR10_11_SS1R3_SIZE                              0x1
#define _RPINR10_11_SS1R3_LENGTH                            0x1
#define _RPINR10_11_SS1R3_MASK                              0x8
#define _RPINR10_11_SCK2R0_POSN                             0x4
#define _RPINR10_11_SCK2R0_POSITION                         0x4
#define _RPINR10_11_SCK2R0_SIZE                             0x1
#define _RPINR10_11_SCK2R0_LENGTH                           0x1
#define _RPINR10_11_SCK2R0_MASK                             0x10
#define _RPINR10_11_SCK2R1_POSN                             0x5
#define _RPINR10_11_SCK2R1_POSITION                         0x5
#define _RPINR10_11_SCK2R1_SIZE                             0x1
#define _RPINR10_11_SCK2R1_LENGTH                           0x1
#define _RPINR10_11_SCK2R1_MASK                             0x20
#define _RPINR10_11_SCK2R2_POSN                             0x6
#define _RPINR10_11_SCK2R2_POSITION                         0x6
#define _RPINR10_11_SCK2R2_SIZE                             0x1
#define _RPINR10_11_SCK2R2_LENGTH                           0x1
#define _RPINR10_11_SCK2R2_MASK                             0x40
#define _RPINR10_11_SCK2R3_POSN                             0x7
#define _RPINR10_11_SCK2R3_POSITION                         0x7
#define _RPINR10_11_SCK2R3_SIZE                             0x1
#define _RPINR10_11_SCK2R3_LENGTH                           0x1
#define _RPINR10_11_SCK2R3_MASK                             0x80

