MikroElektronika/core_packages/PIC/XC8/def/PIC18F85J94/mcu.h
extern volatile RPINR28_29bits_t RPINR28_29bits __at(0xE38);
// bitfield macros
#define _RPINR28_29_INT3R_POSN                              0x0
#define _RPINR28_29_INT3R_POSITION                          0x0
#define _RPINR28_29_INT3R_SIZE                              0x4
#define _RPINR28_29_INT3R_LENGTH                            0x4
#define _RPINR28_29_INT3R_MASK                              0xF
#define _RPINR28_29_MDMINR_POSN                             0x4
#define _RPINR28_29_MDMINR_POSITION                         0x4
#define _RPINR28_29_MDMINR_SIZE                             0x4
#define _RPINR28_29_MDMINR_LENGTH                           0x4
#define _RPINR28_29_MDMINR_MASK                             0xF0
#define _RPINR28_29_INT3R0_POSN                             0x0
#define _RPINR28_29_INT3R0_POSITION                         0x0
#define _RPINR28_29_INT3R0_SIZE                             0x1
#define _RPINR28_29_INT3R0_LENGTH                           0x1
#define _RPINR28_29_INT3R0_MASK                             0x1
#define _RPINR28_29_INT3R1_POSN                             0x1
#define _RPINR28_29_INT3R1_POSITION                         0x1
#define _RPINR28_29_INT3R1_SIZE                             0x1
#define _RPINR28_29_INT3R1_LENGTH                           0x1
#define _RPINR28_29_INT3R1_MASK                             0x2
#define _RPINR28_29_INT3R2_POSN                             0x2
#define _RPINR28_29_INT3R2_POSITION                         0x2
#define _RPINR28_29_INT3R2_SIZE                             0x1
#define _RPINR28_29_INT3R2_LENGTH                           0x1
#define _RPINR28_29_INT3R2_MASK                             0x4
#define _RPINR28_29_INT3R3_POSN                             0x3
#define _RPINR28_29_INT3R3_POSITION                         0x3
#define _RPINR28_29_INT3R3_SIZE                             0x1
#define _RPINR28_29_INT3R3_LENGTH                           0x1
#define _RPINR28_29_INT3R3_MASK                             0x8
#define _RPINR28_29_MDMINR0_POSN                            0x4
#define _RPINR28_29_MDMINR0_POSITION                        0x4
#define _RPINR28_29_MDMINR0_SIZE                            0x1
#define _RPINR28_29_MDMINR0_LENGTH                          0x1
#define _RPINR28_29_MDMINR0_MASK                            0x10
#define _RPINR28_29_MDMINR1_POSN                            0x5
#define _RPINR28_29_MDMINR1_POSITION                        0x5
#define _RPINR28_29_MDMINR1_SIZE                            0x1
#define _RPINR28_29_MDMINR1_LENGTH                          0x1
#define _RPINR28_29_MDMINR1_MASK                            0x20
#define _RPINR28_29_MDMINR2_POSN                            0x6
#define _RPINR28_29_MDMINR2_POSITION                        0x6
#define _RPINR28_29_MDMINR2_SIZE                            0x1
#define _RPINR28_29_MDMINR2_LENGTH                          0x1
#define _RPINR28_29_MDMINR2_MASK                            0x40
#define _RPINR28_29_MDMINR3_POSN                            0x7
#define _RPINR28_29_MDMINR3_POSITION                        0x7
#define _RPINR28_29_MDMINR3_SIZE                            0x1
#define _RPINR28_29_MDMINR3_LENGTH                          0x1
#define _RPINR28_29_MDMINR3_MASK                            0x80

// Register: RPINR30_31
#define RPINR30_31 RPINR30_31
extern volatile unsigned char           RPINR30_31          __at(0xE39);
#ifndef _LIB_BUILD
asm("RPINR30_31 equ 0E39h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MDCIN1R                :4;
        unsigned MDCIN2R                :4;
    };
    struct {
        unsigned MDCIN1R0               :1;
        unsigned MDCIN1R1               :1;
        unsigned MDCIN1R2               :1;
        unsigned MDCIN1R3               :1;
        unsigned MDCIN2R0               :1;
        unsigned MDCIN2R1               :1;
        unsigned MDCIN2R2               :1;
        unsigned MDCIN2R3               :1;
    };
} RPINR30_31bits_t;
extern volatile RPINR30_31bits_t RPINR30_31bits __at(0xE39);
// bitfield macros
#define _RPINR30_31_MDCIN1R_POSN                            0x0
#define _RPINR30_31_MDCIN1R_POSITION                        0x0
#define _RPINR30_31_MDCIN1R_SIZE                            0x4
#define _RPINR30_31_MDCIN1R_LENGTH                          0x4
#define _RPINR30_31_MDCIN1R_MASK                            0xF
#define _RPINR30_31_MDCIN2R_POSN                            0x4
#define _RPINR30_31_MDCIN2R_POSITION                        0x4
#define _RPINR30_31_MDCIN2R_SIZE                            0x4
#define _RPINR30_31_MDCIN2R_LENGTH                          0x4
#define _RPINR30_31_MDCIN2R_MASK                            0xF0
#define _RPINR30_31_MDCIN1R0_POSN                           0x0
#define _RPINR30_31_MDCIN1R0_POSITION                       0x0
#define _RPINR30_31_MDCIN1R0_SIZE                           0x1
#define _RPINR30_31_MDCIN1R0_LENGTH                         0x1
#define _RPINR30_31_MDCIN1R0_MASK                           0x1
#define _RPINR30_31_MDCIN1R1_POSN                           0x1
#define _RPINR30_31_MDCIN1R1_POSITION                       0x1
#define _RPINR30_31_MDCIN1R1_SIZE                           0x1
#define _RPINR30_31_MDCIN1R1_LENGTH                         0x1
#define _RPINR30_31_MDCIN1R1_MASK                           0x2
#define _RPINR30_31_MDCIN1R2_POSN                           0x2
#define _RPINR30_31_MDCIN1R2_POSITION                       0x2
#define _RPINR30_31_MDCIN1R2_SIZE                           0x1
#define _RPINR30_31_MDCIN1R2_LENGTH                         0x1
#define _RPINR30_31_MDCIN1R2_MASK                           0x4
#define _RPINR30_31_MDCIN1R3_POSN                           0x3
#define _RPINR30_31_MDCIN1R3_POSITION                       0x3
#define _RPINR30_31_MDCIN1R3_SIZE                           0x1
#define _RPINR30_31_MDCIN1R3_LENGTH                         0x1
#define _RPINR30_31_MDCIN1R3_MASK                           0x8
#define _RPINR30_31_MDCIN2R0_POSN                           0x4
#define _RPINR30_31_MDCIN2R0_POSITION                       0x4
#define _RPINR30_31_MDCIN2R0_SIZE                           0x1
#define _RPINR30_31_MDCIN2R0_LENGTH                         0x1
#define _RPINR30_31_MDCIN2R0_MASK                           0x10
#define _RPINR30_31_MDCIN2R1_POSN                           0x5
#define _RPINR30_31_MDCIN2R1_POSITION                       0x5
#define _RPINR30_31_MDCIN2R1_SIZE                           0x1
#define _RPINR30_31_MDCIN2R1_LENGTH                         0x1
#define _RPINR30_31_MDCIN2R1_MASK                           0x20
#define _RPINR30_31_MDCIN2R2_POSN                           0x6
#define _RPINR30_31_MDCIN2R2_POSITION                       0x6
#define _RPINR30_31_MDCIN2R2_SIZE                           0x1
#define _RPINR30_31_MDCIN2R2_LENGTH                         0x1
#define _RPINR30_31_MDCIN2R2_MASK                           0x40
#define _RPINR30_31_MDCIN2R3_POSN                           0x7
#define _RPINR30_31_MDCIN2R3_POSITION                       0x7
#define _RPINR30_31_MDCIN2R3_SIZE                           0x1
#define _RPINR30_31_MDCIN2R3_LENGTH                         0x1
#define _RPINR30_31_MDCIN2R3_MASK                           0x80

// Register: RPINR32_33
#define RPINR32_33 RPINR32_33
extern volatile unsigned char           RPINR32_33          __at(0xE3A);
#ifndef _LIB_BUILD
asm("RPINR32_33 equ 0E3Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCP4R                  :4;
        unsigned CCP5R                  :4;
    };
    struct {
        unsigned CCP4R0                 :1;
        unsigned CCP4R1                 :1;
        unsigned CCP4R2                 :1;
        unsigned CCP4R3                 :1;
        unsigned CCP5R0                 :1;
        unsigned CCP5R1                 :1;
        unsigned CCP5R2                 :1;
        unsigned CCP5R3                 :1;
    };
} RPINR32_33bits_t;
