MikroElektronika/core_packages/PIC/XC8/def/PIC18F85J94/mcu.h
// Register: ADCBUF22H
#define ADCBUF22H ADCBUF22H
extern volatile unsigned char           ADCBUF22H           __at(0xE73);
#ifndef _LIB_BUILD
asm("ADCBUF22H equ 0E73h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADCBUF22H              :8;
    };
} ADCBUF22Hbits_t;
extern volatile ADCBUF22Hbits_t ADCBUF22Hbits __at(0xE73);
// bitfield macros
#define _ADCBUF22H_ADCBUF22H_POSN                           0x0
#define _ADCBUF22H_ADCBUF22H_POSITION                       0x0
#define _ADCBUF22H_ADCBUF22H_SIZE                           0x8
#define _ADCBUF22H_ADCBUF22H_LENGTH                         0x8
#define _ADCBUF22H_ADCBUF22H_MASK                           0xFF

// Register: ADCBUF23
#define ADCBUF23 ADCBUF23
extern volatile unsigned short          ADCBUF23            __at(0xE74);
#ifndef _LIB_BUILD
asm("ADCBUF23 equ 0E74h");
#endif

// Register: ADCBUF23L
#define ADCBUF23L ADCBUF23L
extern volatile unsigned char           ADCBUF23L           __at(0xE74);
#ifndef _LIB_BUILD
asm("ADCBUF23L equ 0E74h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADCBUF23L              :8;
    };
} ADCBUF23Lbits_t;
extern volatile ADCBUF23Lbits_t ADCBUF23Lbits __at(0xE74);
// bitfield macros
#define _ADCBUF23L_ADCBUF23L_POSN                           0x0
#define _ADCBUF23L_ADCBUF23L_POSITION                       0x0
#define _ADCBUF23L_ADCBUF23L_SIZE                           0x8
#define _ADCBUF23L_ADCBUF23L_LENGTH                         0x8
#define _ADCBUF23L_ADCBUF23L_MASK                           0xFF

// Register: ADCBUF23H
#define ADCBUF23H ADCBUF23H
extern volatile unsigned char           ADCBUF23H           __at(0xE75);
#ifndef _LIB_BUILD
asm("ADCBUF23H equ 0E75h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADCBUF23H              :8;
    };
} ADCBUF23Hbits_t;
extern volatile ADCBUF23Hbits_t ADCBUF23Hbits __at(0xE75);
// bitfield macros
#define _ADCBUF23H_ADCBUF23H_POSN                           0x0
#define _ADCBUF23H_ADCBUF23H_POSITION                       0x0
#define _ADCBUF23H_ADCBUF23H_SIZE                           0x8
#define _ADCBUF23H_ADCBUF23H_LENGTH                         0x8
#define _ADCBUF23H_ADCBUF23H_MASK                           0xFF

// Register: ADCBUF24
#define ADCBUF24 ADCBUF24
extern volatile unsigned short          ADCBUF24            __at(0xE76);
#ifndef _LIB_BUILD
asm("ADCBUF24 equ 0E76h");
#endif

// Register: ADCBUF24L
#define ADCBUF24L ADCBUF24L
extern volatile unsigned char           ADCBUF24L           __at(0xE76);
#ifndef _LIB_BUILD
asm("ADCBUF24L equ 0E76h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADCBUF24L              :8;
    };
} ADCBUF24Lbits_t;
extern volatile ADCBUF24Lbits_t ADCBUF24Lbits __at(0xE76);
// bitfield macros
#define _ADCBUF24L_ADCBUF24L_POSN                           0x0
#define _ADCBUF24L_ADCBUF24L_POSITION                       0x0
#define _ADCBUF24L_ADCBUF24L_SIZE                           0x8
#define _ADCBUF24L_ADCBUF24L_LENGTH                         0x8
#define _ADCBUF24L_ADCBUF24L_MASK                           0xFF

// Register: ADCBUF24H
#define ADCBUF24H ADCBUF24H
extern volatile unsigned char           ADCBUF24H           __at(0xE77);
#ifndef _LIB_BUILD
asm("ADCBUF24H equ 0E77h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADCBUF24H              :8;
    };
} ADCBUF24Hbits_t;
extern volatile ADCBUF24Hbits_t ADCBUF24Hbits __at(0xE77);
// bitfield macros
#define _ADCBUF24H_ADCBUF24H_POSN                           0x0
#define _ADCBUF24H_ADCBUF24H_POSITION                       0x0
#define _ADCBUF24H_ADCBUF24H_SIZE                           0x8
#define _ADCBUF24H_ADCBUF24H_LENGTH                         0x8
#define _ADCBUF24H_ADCBUF24H_MASK                           0xFF

// Register: ADCBUF25
#define ADCBUF25 ADCBUF25
extern volatile unsigned short          ADCBUF25            __at(0xE78);
#ifndef _LIB_BUILD
asm("ADCBUF25 equ 0E78h");
#endif

// Register: ADCBUF25L
#define ADCBUF25L ADCBUF25L
extern volatile unsigned char           ADCBUF25L           __at(0xE78);
#ifndef _LIB_BUILD
asm("ADCBUF25L equ 0E78h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADCBUF25L              :8;
    };
} ADCBUF25Lbits_t;
extern volatile ADCBUF25Lbits_t ADCBUF25Lbits __at(0xE78);
// bitfield macros
#define _ADCBUF25L_ADCBUF25L_POSN                           0x0
#define _ADCBUF25L_ADCBUF25L_POSITION                       0x0
#define _ADCBUF25L_ADCBUF25L_SIZE                           0x8
#define _ADCBUF25L_ADCBUF25L_LENGTH                         0x8
#define _ADCBUF25L_ADCBUF25L_MASK                           0xFF

// Register: ADCBUF25H
#define ADCBUF25H ADCBUF25H
extern volatile unsigned char           ADCBUF25H           __at(0xE79);
#ifndef _LIB_BUILD
asm("ADCBUF25H equ 0E79h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADCBUF25H              :8;
    };
} ADCBUF25Hbits_t;
extern volatile ADCBUF25Hbits_t ADCBUF25Hbits __at(0xE79);
// bitfield macros
#define _ADCBUF25H_ADCBUF25H_POSN                           0x0
#define _ADCBUF25H_ADCBUF25H_POSITION                       0x0
#define _ADCBUF25H_ADCBUF25H_SIZE                           0x8
#define _ADCBUF25H_ADCBUF25H_LENGTH                         0x8
#define _ADCBUF25H_ADCBUF25H_MASK                           0xFF

// Register: ADCTMUEN0L
#define ADCTMUEN0L ADCTMUEN0L
extern volatile unsigned char           ADCTMUEN0L          __at(0xE7A);
#ifndef _LIB_BUILD
asm("ADCTMUEN0L equ 0E7Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CTMUEN                 :8;
    };
    struct {
        unsigned CTMUEN0                :1;
        unsigned CTMUEN1                :1;
        unsigned CTMUEN2                :1;
        unsigned CTMUEN3                :1;
        unsigned CTMUEN4                :1;
        unsigned CTMUEN5                :1;
        unsigned CTMUEN6                :1;
        unsigned CTMUEN7                :1;
    };
} ADCTMUEN0Lbits_t;
extern volatile ADCTMUEN0Lbits_t ADCTMUEN0Lbits __at(0xE7A);
// bitfield macros
#define _ADCTMUEN0L_CTMUEN_POSN                             0x0
#define _ADCTMUEN0L_CTMUEN_POSITION                         0x0
#define _ADCTMUEN0L_CTMUEN_SIZE                             0x8
#define _ADCTMUEN0L_CTMUEN_LENGTH                           0x8
#define _ADCTMUEN0L_CTMUEN_MASK                             0xFF
#define _ADCTMUEN0L_CTMUEN0_POSN                            0x0
#define _ADCTMUEN0L_CTMUEN0_POSITION                        0x0
#define _ADCTMUEN0L_CTMUEN0_SIZE                            0x1
#define _ADCTMUEN0L_CTMUEN0_LENGTH                          0x1
#define _ADCTMUEN0L_CTMUEN0_MASK                            0x1
#define _ADCTMUEN0L_CTMUEN1_POSN                            0x1
#define _ADCTMUEN0L_CTMUEN1_POSITION                        0x1
#define _ADCTMUEN0L_CTMUEN1_SIZE                            0x1
#define _ADCTMUEN0L_CTMUEN1_LENGTH                          0x1
#define _ADCTMUEN0L_CTMUEN1_MASK                            0x2
#define _ADCTMUEN0L_CTMUEN2_POSN                            0x2
#define _ADCTMUEN0L_CTMUEN2_POSITION                        0x2
#define _ADCTMUEN0L_CTMUEN2_SIZE                            0x1
#define _ADCTMUEN0L_CTMUEN2_LENGTH                          0x1
#define _ADCTMUEN0L_CTMUEN2_MASK                            0x4
#define _ADCTMUEN0L_CTMUEN3_POSN                            0x3
#define _ADCTMUEN0L_CTMUEN3_POSITION                        0x3
#define _ADCTMUEN0L_CTMUEN3_SIZE                            0x1
#define _ADCTMUEN0L_CTMUEN3_LENGTH                          0x1
#define _ADCTMUEN0L_CTMUEN3_MASK                            0x8
#define _ADCTMUEN0L_CTMUEN4_POSN                            0x4
#define _ADCTMUEN0L_CTMUEN4_POSITION                        0x4
#define _ADCTMUEN0L_CTMUEN4_SIZE                            0x1
#define _ADCTMUEN0L_CTMUEN4_LENGTH                          0x1
#define _ADCTMUEN0L_CTMUEN4_MASK                            0x10
#define _ADCTMUEN0L_CTMUEN5_POSN                            0x5
#define _ADCTMUEN0L_CTMUEN5_POSITION                        0x5
#define _ADCTMUEN0L_CTMUEN5_SIZE                            0x1
#define _ADCTMUEN0L_CTMUEN5_LENGTH                          0x1
#define _ADCTMUEN0L_CTMUEN5_MASK                            0x20
#define _ADCTMUEN0L_CTMUEN6_POSN                            0x6
#define _ADCTMUEN0L_CTMUEN6_POSITION                        0x6
#define _ADCTMUEN0L_CTMUEN6_SIZE                            0x1
#define _ADCTMUEN0L_CTMUEN6_LENGTH                          0x1
#define _ADCTMUEN0L_CTMUEN6_MASK                            0x40
#define _ADCTMUEN0L_CTMUEN7_POSN                            0x7
#define _ADCTMUEN0L_CTMUEN7_POSITION                        0x7
#define _ADCTMUEN0L_CTMUEN7_SIZE                            0x1
#define _ADCTMUEN0L_CTMUEN7_LENGTH                          0x1
#define _ADCTMUEN0L_CTMUEN7_MASK                            0x80

// Register: ADCTMUEN0H
#define ADCTMUEN0H ADCTMUEN0H
extern volatile unsigned char           ADCTMUEN0H          __at(0xE7B);
#ifndef _LIB_BUILD
asm("ADCTMUEN0H equ 0E7Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CTMUEN                 :8;
    };
    struct {
        unsigned CTMUEN8                :1;
        unsigned CTMUEN9                :1;
        unsigned CTMUEN10               :1;
        unsigned CTMUEN11               :1;
        unsigned CTMUEN12               :1;
        unsigned CTMUEN13               :1;
        unsigned CTMUEN14               :1;
        unsigned CTMUEN15               :1;
    };
} ADCTMUEN0Hbits_t;
extern volatile ADCTMUEN0Hbits_t ADCTMUEN0Hbits __at(0xE7B);
// bitfield macros
#define _ADCTMUEN0H_CTMUEN_POSN                             0x0
#define _ADCTMUEN0H_CTMUEN_POSITION                         0x0
#define _ADCTMUEN0H_CTMUEN_SIZE                             0x8
#define _ADCTMUEN0H_CTMUEN_LENGTH                           0x8
#define _ADCTMUEN0H_CTMUEN_MASK                             0xFF
#define _ADCTMUEN0H_CTMUEN8_POSN                            0x0
#define _ADCTMUEN0H_CTMUEN8_POSITION                        0x0
#define _ADCTMUEN0H_CTMUEN8_SIZE                            0x1
#define _ADCTMUEN0H_CTMUEN8_LENGTH                          0x1
#define _ADCTMUEN0H_CTMUEN8_MASK                            0x1
#define _ADCTMUEN0H_CTMUEN9_POSN                            0x1
#define _ADCTMUEN0H_CTMUEN9_POSITION                        0x1
#define _ADCTMUEN0H_CTMUEN9_SIZE                            0x1
#define _ADCTMUEN0H_CTMUEN9_LENGTH                          0x1
#define _ADCTMUEN0H_CTMUEN9_MASK                            0x2
#define _ADCTMUEN0H_CTMUEN10_POSN                           0x2
#define _ADCTMUEN0H_CTMUEN10_POSITION                       0x2
#define _ADCTMUEN0H_CTMUEN10_SIZE                           0x1
#define _ADCTMUEN0H_CTMUEN10_LENGTH                         0x1
#define _ADCTMUEN0H_CTMUEN10_MASK                           0x4
#define _ADCTMUEN0H_CTMUEN11_POSN                           0x3
#define _ADCTMUEN0H_CTMUEN11_POSITION                       0x3
#define _ADCTMUEN0H_CTMUEN11_SIZE                           0x1
#define _ADCTMUEN0H_CTMUEN11_LENGTH                         0x1
#define _ADCTMUEN0H_CTMUEN11_MASK                           0x8
#define _ADCTMUEN0H_CTMUEN12_POSN                           0x4
#define _ADCTMUEN0H_CTMUEN12_POSITION                       0x4
#define _ADCTMUEN0H_CTMUEN12_SIZE                           0x1
#define _ADCTMUEN0H_CTMUEN12_LENGTH                         0x1
#define _ADCTMUEN0H_CTMUEN12_MASK                           0x10
#define _ADCTMUEN0H_CTMUEN13_POSN                           0x5
#define _ADCTMUEN0H_CTMUEN13_POSITION                       0x5
#define _ADCTMUEN0H_CTMUEN13_SIZE                           0x1
#define _ADCTMUEN0H_CTMUEN13_LENGTH                         0x1
#define _ADCTMUEN0H_CTMUEN13_MASK                           0x20
#define _ADCTMUEN0H_CTMUEN14_POSN                           0x6
#define _ADCTMUEN0H_CTMUEN14_POSITION                       0x6
#define _ADCTMUEN0H_CTMUEN14_SIZE                           0x1
#define _ADCTMUEN0H_CTMUEN14_LENGTH                         0x1
#define _ADCTMUEN0H_CTMUEN14_MASK                           0x40
#define _ADCTMUEN0H_CTMUEN15_POSN                           0x7
#define _ADCTMUEN0H_CTMUEN15_POSITION                       0x7
#define _ADCTMUEN0H_CTMUEN15_SIZE                           0x1
#define _ADCTMUEN0H_CTMUEN15_LENGTH                         0x1
#define _ADCTMUEN0H_CTMUEN15_MASK                           0x80

// Register: ADCTMUEN1L
#define ADCTMUEN1L ADCTMUEN1L
extern volatile unsigned char           ADCTMUEN1L          __at(0xE7C);
#ifndef _LIB_BUILD
asm("ADCTMUEN1L equ 0E7Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CTMUEN                 :8;
    };
    struct {
        unsigned CTUMEN16               :1;
        unsigned CTUMEN17               :1;
        unsigned CTUMEN18               :1;
        unsigned CTUMEN19               :1;
        unsigned CTMUEN20               :1;
        unsigned CTMUEN21               :1;
        unsigned CTMUEN22               :1;
        unsigned CTMUEN23               :1;
    };
} ADCTMUEN1Lbits_t;
