MikroElektronika/core_packages/PIC/XC8/def/PIC18F85J94/mcu.h
extern volatile LCDDATA54bits_t LCDDATA54bits __at(0xEC4);
// bitfield macros
#define _LCDDATA54_S48C6_POSN                               0x0
#define _LCDDATA54_S48C6_POSITION                           0x0
#define _LCDDATA54_S48C6_SIZE                               0x1
#define _LCDDATA54_S48C6_LENGTH                             0x1
#define _LCDDATA54_S48C6_MASK                               0x1
#define _LCDDATA54_S49C6_POSN                               0x1
#define _LCDDATA54_S49C6_POSITION                           0x1
#define _LCDDATA54_S49C6_SIZE                               0x1
#define _LCDDATA54_S49C6_LENGTH                             0x1
#define _LCDDATA54_S49C6_MASK                               0x2
#define _LCDDATA54_S50C6_POSN                               0x2
#define _LCDDATA54_S50C6_POSITION                           0x2
#define _LCDDATA54_S50C6_SIZE                               0x1
#define _LCDDATA54_S50C6_LENGTH                             0x1
#define _LCDDATA54_S50C6_MASK                               0x4
#define _LCDDATA54_S51C6_POSN                               0x3
#define _LCDDATA54_S51C6_POSITION                           0x3
#define _LCDDATA54_S51C6_SIZE                               0x1
#define _LCDDATA54_S51C6_LENGTH                             0x1
#define _LCDDATA54_S51C6_MASK                               0x8
#define _LCDDATA54_S52C6_POSN                               0x4
#define _LCDDATA54_S52C6_POSITION                           0x4
#define _LCDDATA54_S52C6_SIZE                               0x1
#define _LCDDATA54_S52C6_LENGTH                             0x1
#define _LCDDATA54_S52C6_MASK                               0x10
#define _LCDDATA54_S53C6_POSN                               0x5
#define _LCDDATA54_S53C6_POSITION                           0x5
#define _LCDDATA54_S53C6_SIZE                               0x1
#define _LCDDATA54_S53C6_LENGTH                             0x1
#define _LCDDATA54_S53C6_MASK                               0x20
#define _LCDDATA54_S54C6_POSN                               0x6
#define _LCDDATA54_S54C6_POSITION                           0x6
#define _LCDDATA54_S54C6_SIZE                               0x1
#define _LCDDATA54_S54C6_LENGTH                             0x1
#define _LCDDATA54_S54C6_MASK                               0x40
#define _LCDDATA54_S55C6_POSN                               0x7
#define _LCDDATA54_S55C6_POSITION                           0x7
#define _LCDDATA54_S55C6_SIZE                               0x1
#define _LCDDATA54_S55C6_LENGTH                             0x1
#define _LCDDATA54_S55C6_MASK                               0x80

// Register: LCDDATA55
#define LCDDATA55 LCDDATA55
extern volatile unsigned char           LCDDATA55           __at(0xEC5);
#ifndef _LIB_BUILD
asm("LCDDATA55 equ 0EC5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S56C6                  :1;
        unsigned S57C6                  :1;
        unsigned S58C6                  :1;
        unsigned S59C6                  :1;
        unsigned S60C6                  :1;
        unsigned S61C6                  :1;
        unsigned S62C6                  :1;
        unsigned S63C6                  :1;
    };
} LCDDATA55bits_t;
extern volatile LCDDATA55bits_t LCDDATA55bits __at(0xEC5);
// bitfield macros
#define _LCDDATA55_S56C6_POSN                               0x0
#define _LCDDATA55_S56C6_POSITION                           0x0
#define _LCDDATA55_S56C6_SIZE                               0x1
#define _LCDDATA55_S56C6_LENGTH                             0x1
#define _LCDDATA55_S56C6_MASK                               0x1
#define _LCDDATA55_S57C6_POSN                               0x1
#define _LCDDATA55_S57C6_POSITION                           0x1
#define _LCDDATA55_S57C6_SIZE                               0x1
#define _LCDDATA55_S57C6_LENGTH                             0x1
#define _LCDDATA55_S57C6_MASK                               0x2
#define _LCDDATA55_S58C6_POSN                               0x2
#define _LCDDATA55_S58C6_POSITION                           0x2
#define _LCDDATA55_S58C6_SIZE                               0x1
#define _LCDDATA55_S58C6_LENGTH                             0x1
#define _LCDDATA55_S58C6_MASK                               0x4
#define _LCDDATA55_S59C6_POSN                               0x3
#define _LCDDATA55_S59C6_POSITION                           0x3
#define _LCDDATA55_S59C6_SIZE                               0x1
#define _LCDDATA55_S59C6_LENGTH                             0x1
#define _LCDDATA55_S59C6_MASK                               0x8
#define _LCDDATA55_S60C6_POSN                               0x4
#define _LCDDATA55_S60C6_POSITION                           0x4
#define _LCDDATA55_S60C6_SIZE                               0x1
#define _LCDDATA55_S60C6_LENGTH                             0x1
#define _LCDDATA55_S60C6_MASK                               0x10
#define _LCDDATA55_S61C6_POSN                               0x5
#define _LCDDATA55_S61C6_POSITION                           0x5
#define _LCDDATA55_S61C6_SIZE                               0x1
#define _LCDDATA55_S61C6_LENGTH                             0x1
#define _LCDDATA55_S61C6_MASK                               0x20
#define _LCDDATA55_S62C6_POSN                               0x6
#define _LCDDATA55_S62C6_POSITION                           0x6
#define _LCDDATA55_S62C6_SIZE                               0x1
#define _LCDDATA55_S62C6_LENGTH                             0x1
#define _LCDDATA55_S62C6_MASK                               0x40
#define _LCDDATA55_S63C6_POSN                               0x7
#define _LCDDATA55_S63C6_POSITION                           0x7
#define _LCDDATA55_S63C6_SIZE                               0x1
#define _LCDDATA55_S63C6_LENGTH                             0x1
#define _LCDDATA55_S63C6_MASK                               0x80

// Register: LCDDATA56
#define LCDDATA56 LCDDATA56
extern volatile unsigned char           LCDDATA56           __at(0xEC6);
#ifndef _LIB_BUILD
asm("LCDDATA56 equ 0EC6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S00C7                  :1;
        unsigned S01C7                  :1;
        unsigned S02C7                  :1;
        unsigned S03C7                  :1;
        unsigned S04C7                  :1;
        unsigned S05C7                  :1;
        unsigned S06C7                  :1;
        unsigned S07C7                  :1;
    };
} LCDDATA56bits_t;
