MikroElektronika/core_packages/PIC/XC8/def/PIC18F85J94/mcu.h
extern volatile SSP2BUFbits_t SSP2BUFbits __at(0xF03);
// bitfield macros
#define _SSP2BUF_SSPBUF_POSN                                0x0
#define _SSP2BUF_SSPBUF_POSITION                            0x0
#define _SSP2BUF_SSPBUF_SIZE                                0x8
#define _SSP2BUF_SSPBUF_LENGTH                              0x8
#define _SSP2BUF_SSPBUF_MASK                                0xFF

// Register: T4CON
#define T4CON T4CON
extern volatile unsigned char           T4CON               __at(0xF04);
#ifndef _LIB_BUILD
asm("T4CON equ 0F04h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned T4CKPS                 :2;
        unsigned TMR4ON                 :1;
        unsigned T4OUTPS                :4;
    };
    struct {
        unsigned T4CKPS0                :1;
        unsigned T4CKPS1                :1;
        unsigned                        :1;
        unsigned T4OUTPS0               :1;
        unsigned T4OUTPS1               :1;
        unsigned T4OUTPS2               :1;
        unsigned T4OUTPS3               :1;
    };
} T4CONbits_t;
extern volatile T4CONbits_t T4CONbits __at(0xF04);
// bitfield macros
#define _T4CON_T4CKPS_POSN                                  0x0
#define _T4CON_T4CKPS_POSITION                              0x0
#define _T4CON_T4CKPS_SIZE                                  0x2
#define _T4CON_T4CKPS_LENGTH                                0x2
#define _T4CON_T4CKPS_MASK                                  0x3
#define _T4CON_TMR4ON_POSN                                  0x2
#define _T4CON_TMR4ON_POSITION                              0x2
#define _T4CON_TMR4ON_SIZE                                  0x1
#define _T4CON_TMR4ON_LENGTH                                0x1
#define _T4CON_TMR4ON_MASK                                  0x4
#define _T4CON_T4OUTPS_POSN                                 0x3
#define _T4CON_T4OUTPS_POSITION                             0x3
#define _T4CON_T4OUTPS_SIZE                                 0x4
#define _T4CON_T4OUTPS_LENGTH                               0x4
#define _T4CON_T4OUTPS_MASK                                 0x78
#define _T4CON_T4CKPS0_POSN                                 0x0
#define _T4CON_T4CKPS0_POSITION                             0x0
#define _T4CON_T4CKPS0_SIZE                                 0x1
#define _T4CON_T4CKPS0_LENGTH                               0x1
#define _T4CON_T4CKPS0_MASK                                 0x1
#define _T4CON_T4CKPS1_POSN                                 0x1
#define _T4CON_T4CKPS1_POSITION                             0x1
#define _T4CON_T4CKPS1_SIZE                                 0x1
#define _T4CON_T4CKPS1_LENGTH                               0x1
#define _T4CON_T4CKPS1_MASK                                 0x2
#define _T4CON_T4OUTPS0_POSN                                0x3
#define _T4CON_T4OUTPS0_POSITION                            0x3
#define _T4CON_T4OUTPS0_SIZE                                0x1
#define _T4CON_T4OUTPS0_LENGTH                              0x1
#define _T4CON_T4OUTPS0_MASK                                0x8
#define _T4CON_T4OUTPS1_POSN                                0x4
#define _T4CON_T4OUTPS1_POSITION                            0x4
#define _T4CON_T4OUTPS1_SIZE                                0x1
#define _T4CON_T4OUTPS1_LENGTH                              0x1
#define _T4CON_T4OUTPS1_MASK                                0x10
#define _T4CON_T4OUTPS2_POSN                                0x5
#define _T4CON_T4OUTPS2_POSITION                            0x5
#define _T4CON_T4OUTPS2_SIZE                                0x1
#define _T4CON_T4OUTPS2_LENGTH                              0x1
#define _T4CON_T4OUTPS2_MASK                                0x20
#define _T4CON_T4OUTPS3_POSN                                0x6
#define _T4CON_T4OUTPS3_POSITION                            0x6
#define _T4CON_T4OUTPS3_SIZE                                0x1
#define _T4CON_T4OUTPS3_LENGTH                              0x1
#define _T4CON_T4OUTPS3_MASK                                0x40

// Register: PR4
#define PR4 PR4
extern volatile unsigned char           PR4                 __at(0xF05);
#ifndef _LIB_BUILD
asm("PR4 equ 0F05h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PR4                    :8;
    };
} PR4bits_t;
extern volatile PR4bits_t PR4bits __at(0xF05);
// bitfield macros
#define _PR4_PR4_POSN                                       0x0
#define _PR4_PR4_POSITION                                   0x0
#define _PR4_PR4_SIZE                                       0x8
#define _PR4_PR4_LENGTH                                     0x8
#define _PR4_PR4_MASK                                       0xFF

// Register: TMR4
#define TMR4 TMR4
extern volatile unsigned char           TMR4                __at(0xF06);
#ifndef _LIB_BUILD
asm("TMR4 equ 0F06h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR4                   :8;
    };
} TMR4bits_t;
extern volatile TMR4bits_t TMR4bits __at(0xF06);
// bitfield macros
#define _TMR4_TMR4_POSN                                     0x0
#define _TMR4_TMR4_POSITION                                 0x0
#define _TMR4_TMR4_SIZE                                     0x8
#define _TMR4_TMR4_LENGTH                                   0x8
#define _TMR4_TMR4_MASK                                     0xFF

// Register: CCP7CON
#define CCP7CON CCP7CON
extern volatile unsigned char           CCP7CON             __at(0xF07);
#ifndef _LIB_BUILD
asm("CCP7CON equ 0F07h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCP7M                  :4;
        unsigned DC7B                   :2;
    };
    struct {
        unsigned CCP7M0                 :1;
        unsigned CCP7M1                 :1;
        unsigned CCP7M2                 :1;
        unsigned CCP7M3                 :1;
        unsigned DC7B0                  :1;
        unsigned DC7B1                  :1;
    };
    struct {
        unsigned                        :4;
        unsigned CCP7Y                  :1;
        unsigned CCP7X                  :1;
    };
} CCP7CONbits_t;
extern volatile CCP7CONbits_t CCP7CONbits __at(0xF07);
// bitfield macros
#define _CCP7CON_CCP7M_POSN                                 0x0
#define _CCP7CON_CCP7M_POSITION                             0x0
#define _CCP7CON_CCP7M_SIZE                                 0x4
#define _CCP7CON_CCP7M_LENGTH                               0x4
#define _CCP7CON_CCP7M_MASK                                 0xF
#define _CCP7CON_DC7B_POSN                                  0x4
#define _CCP7CON_DC7B_POSITION                              0x4
#define _CCP7CON_DC7B_SIZE                                  0x2
#define _CCP7CON_DC7B_LENGTH                                0x2
#define _CCP7CON_DC7B_MASK                                  0x30
#define _CCP7CON_CCP7M0_POSN                                0x0
#define _CCP7CON_CCP7M0_POSITION                            0x0
#define _CCP7CON_CCP7M0_SIZE                                0x1
#define _CCP7CON_CCP7M0_LENGTH                              0x1
#define _CCP7CON_CCP7M0_MASK                                0x1
#define _CCP7CON_CCP7M1_POSN                                0x1
#define _CCP7CON_CCP7M1_POSITION                            0x1
#define _CCP7CON_CCP7M1_SIZE                                0x1
#define _CCP7CON_CCP7M1_LENGTH                              0x1
#define _CCP7CON_CCP7M1_MASK                                0x2
#define _CCP7CON_CCP7M2_POSN                                0x2
#define _CCP7CON_CCP7M2_POSITION                            0x2
#define _CCP7CON_CCP7M2_SIZE                                0x1
#define _CCP7CON_CCP7M2_LENGTH                              0x1
#define _CCP7CON_CCP7M2_MASK                                0x4
#define _CCP7CON_CCP7M3_POSN                                0x3
#define _CCP7CON_CCP7M3_POSITION                            0x3
#define _CCP7CON_CCP7M3_SIZE                                0x1
#define _CCP7CON_CCP7M3_LENGTH                              0x1
#define _CCP7CON_CCP7M3_MASK                                0x8
#define _CCP7CON_DC7B0_POSN                                 0x4
#define _CCP7CON_DC7B0_POSITION                             0x4
#define _CCP7CON_DC7B0_SIZE                                 0x1
#define _CCP7CON_DC7B0_LENGTH                               0x1
#define _CCP7CON_DC7B0_MASK                                 0x10
#define _CCP7CON_DC7B1_POSN                                 0x5
#define _CCP7CON_DC7B1_POSITION                             0x5
#define _CCP7CON_DC7B1_SIZE                                 0x1
#define _CCP7CON_DC7B1_LENGTH                               0x1
#define _CCP7CON_DC7B1_MASK                                 0x20
#define _CCP7CON_CCP7Y_POSN                                 0x4
#define _CCP7CON_CCP7Y_POSITION                             0x4
#define _CCP7CON_CCP7Y_SIZE                                 0x1
#define _CCP7CON_CCP7Y_LENGTH                               0x1
#define _CCP7CON_CCP7Y_MASK                                 0x10
#define _CCP7CON_CCP7X_POSN                                 0x5
#define _CCP7CON_CCP7X_POSITION                             0x5
#define _CCP7CON_CCP7X_SIZE                                 0x1
#define _CCP7CON_CCP7X_LENGTH                               0x1
#define _CCP7CON_CCP7X_MASK                                 0x20

