MikroElektronika/core_packages/PIC/XC8/def/PIC18F85J94/mcu.h
// Register: IOCP
#define IOCP IOCP
extern volatile unsigned char           IOCP                __at(0xF56);
#ifndef _LIB_BUILD
asm("IOCP equ 0F56h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IOCP0                  :1;
        unsigned IOCP1                  :1;
        unsigned IOCP2                  :1;
        unsigned IOCP3                  :1;
        unsigned IOCP4                  :1;
        unsigned IOCP5                  :1;
        unsigned IOCP6                  :1;
        unsigned IOCP7                  :1;
    };
} IOCPbits_t;
extern volatile IOCPbits_t IOCPbits __at(0xF56);
// bitfield macros
#define _IOCP_IOCP0_POSN                                    0x0
#define _IOCP_IOCP0_POSITION                                0x0
#define _IOCP_IOCP0_SIZE                                    0x1
#define _IOCP_IOCP0_LENGTH                                  0x1
#define _IOCP_IOCP0_MASK                                    0x1
#define _IOCP_IOCP1_POSN                                    0x1
#define _IOCP_IOCP1_POSITION                                0x1
#define _IOCP_IOCP1_SIZE                                    0x1
#define _IOCP_IOCP1_LENGTH                                  0x1
#define _IOCP_IOCP1_MASK                                    0x2
#define _IOCP_IOCP2_POSN                                    0x2
#define _IOCP_IOCP2_POSITION                                0x2
#define _IOCP_IOCP2_SIZE                                    0x1
#define _IOCP_IOCP2_LENGTH                                  0x1
#define _IOCP_IOCP2_MASK                                    0x4
#define _IOCP_IOCP3_POSN                                    0x3
#define _IOCP_IOCP3_POSITION                                0x3
#define _IOCP_IOCP3_SIZE                                    0x1
#define _IOCP_IOCP3_LENGTH                                  0x1
#define _IOCP_IOCP3_MASK                                    0x8
#define _IOCP_IOCP4_POSN                                    0x4
#define _IOCP_IOCP4_POSITION                                0x4
#define _IOCP_IOCP4_SIZE                                    0x1
#define _IOCP_IOCP4_LENGTH                                  0x1
#define _IOCP_IOCP4_MASK                                    0x10
#define _IOCP_IOCP5_POSN                                    0x5
#define _IOCP_IOCP5_POSITION                                0x5
#define _IOCP_IOCP5_SIZE                                    0x1
#define _IOCP_IOCP5_LENGTH                                  0x1
#define _IOCP_IOCP5_MASK                                    0x20
#define _IOCP_IOCP6_POSN                                    0x6
#define _IOCP_IOCP6_POSITION                                0x6
#define _IOCP_IOCP6_SIZE                                    0x1
#define _IOCP_IOCP6_LENGTH                                  0x1
#define _IOCP_IOCP6_MASK                                    0x40
#define _IOCP_IOCP7_POSN                                    0x7
#define _IOCP_IOCP7_POSITION                                0x7
#define _IOCP_IOCP7_SIZE                                    0x1
#define _IOCP_IOCP7_LENGTH                                  0x1
#define _IOCP_IOCP7_MASK                                    0x80

// Register: RTCCON2
#define RTCCON2 RTCCON2
extern volatile unsigned char           RTCCON2             __at(0xF57);
#ifndef _LIB_BUILD
asm("RTCCON2 equ 0F57h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RTCSECSEL              :2;
        unsigned RTCCLKSEL              :2;
        unsigned PWCSPRE                :1;
        unsigned PWCCPRE                :1;
        unsigned PWCPOL                 :1;
        unsigned PWCEN                  :1;
    };
    struct {
        unsigned RTCSECSEL0             :1;
        unsigned RTCSECSEL1             :1;
        unsigned RTCCLKSEL0             :1;
        unsigned RTCCLKSEL1             :1;
    };
} RTCCON2bits_t;
extern volatile RTCCON2bits_t RTCCON2bits __at(0xF57);
// bitfield macros
#define _RTCCON2_RTCSECSEL_POSN                             0x0
#define _RTCCON2_RTCSECSEL_POSITION                         0x0
#define _RTCCON2_RTCSECSEL_SIZE                             0x2
#define _RTCCON2_RTCSECSEL_LENGTH                           0x2
#define _RTCCON2_RTCSECSEL_MASK                             0x3
#define _RTCCON2_RTCCLKSEL_POSN                             0x2
#define _RTCCON2_RTCCLKSEL_POSITION                         0x2
#define _RTCCON2_RTCCLKSEL_SIZE                             0x2
#define _RTCCON2_RTCCLKSEL_LENGTH                           0x2
#define _RTCCON2_RTCCLKSEL_MASK                             0xC
#define _RTCCON2_PWCSPRE_POSN                               0x4
#define _RTCCON2_PWCSPRE_POSITION                           0x4
#define _RTCCON2_PWCSPRE_SIZE                               0x1
#define _RTCCON2_PWCSPRE_LENGTH                             0x1
#define _RTCCON2_PWCSPRE_MASK                               0x10
#define _RTCCON2_PWCCPRE_POSN                               0x5
#define _RTCCON2_PWCCPRE_POSITION                           0x5
#define _RTCCON2_PWCCPRE_SIZE                               0x1
#define _RTCCON2_PWCCPRE_LENGTH                             0x1
#define _RTCCON2_PWCCPRE_MASK                               0x20
#define _RTCCON2_PWCPOL_POSN                                0x6
#define _RTCCON2_PWCPOL_POSITION                            0x6
#define _RTCCON2_PWCPOL_SIZE                                0x1
#define _RTCCON2_PWCPOL_LENGTH                              0x1
#define _RTCCON2_PWCPOL_MASK                                0x40
#define _RTCCON2_PWCEN_POSN                                 0x7
#define _RTCCON2_PWCEN_POSITION                             0x7
#define _RTCCON2_PWCEN_SIZE                                 0x1
#define _RTCCON2_PWCEN_LENGTH                               0x1
#define _RTCCON2_PWCEN_MASK                                 0x80
#define _RTCCON2_RTCSECSEL0_POSN                            0x0
#define _RTCCON2_RTCSECSEL0_POSITION                        0x0
#define _RTCCON2_RTCSECSEL0_SIZE                            0x1
#define _RTCCON2_RTCSECSEL0_LENGTH                          0x1
#define _RTCCON2_RTCSECSEL0_MASK                            0x1
#define _RTCCON2_RTCSECSEL1_POSN                            0x1
#define _RTCCON2_RTCSECSEL1_POSITION                        0x1
#define _RTCCON2_RTCSECSEL1_SIZE                            0x1
#define _RTCCON2_RTCSECSEL1_LENGTH                          0x1
#define _RTCCON2_RTCSECSEL1_MASK                            0x2
#define _RTCCON2_RTCCLKSEL0_POSN                            0x2
#define _RTCCON2_RTCCLKSEL0_POSITION                        0x2
#define _RTCCON2_RTCCLKSEL0_SIZE                            0x1
#define _RTCCON2_RTCCLKSEL0_LENGTH                          0x1
#define _RTCCON2_RTCCLKSEL0_MASK                            0x4
#define _RTCCON2_RTCCLKSEL1_POSN                            0x3
#define _RTCCON2_RTCCLKSEL1_POSITION                        0x3
#define _RTCCON2_RTCCLKSEL1_SIZE                            0x1
#define _RTCCON2_RTCCLKSEL1_LENGTH                          0x1
#define _RTCCON2_RTCCLKSEL1_MASK                            0x8

// Register: ALRMVALL
#define ALRMVALL ALRMVALL
extern volatile unsigned char           ALRMVALL            __at(0xF58);
#ifndef _LIB_BUILD
asm("ALRMVALL equ 0F58h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ALRMVALL               :8;
    };
} ALRMVALLbits_t;
extern volatile ALRMVALLbits_t ALRMVALLbits __at(0xF58);
// bitfield macros
#define _ALRMVALL_ALRMVALL_POSN                             0x0
#define _ALRMVALL_ALRMVALL_POSITION                         0x0
#define _ALRMVALL_ALRMVALL_SIZE                             0x8
#define _ALRMVALL_ALRMVALL_LENGTH                           0x8
#define _ALRMVALL_ALRMVALL_MASK                             0xFF

