MikroElektronika/core_packages/PIC/XC8/def/PIC18F85J94/mcu.h
// Register: TMR3H
#define TMR3H TMR3H
extern volatile unsigned char           TMR3H               __at(0xFB3);
#ifndef _LIB_BUILD
asm("TMR3H equ 0FB3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR3H                  :8;
    };
} TMR3Hbits_t;
extern volatile TMR3Hbits_t TMR3Hbits __at(0xFB3);
// bitfield macros
#define _TMR3H_TMR3H_POSN                                   0x0
#define _TMR3H_TMR3H_POSITION                               0x0
#define _TMR3H_TMR3H_SIZE                                   0x8
#define _TMR3H_TMR3H_LENGTH                                 0x8
#define _TMR3H_TMR3H_MASK                                   0xFF

// Register: PIE4
#define PIE4 PIE4
extern volatile unsigned char           PIE4                __at(0xFB4);
#ifndef _LIB_BUILD
asm("PIE4 equ 0FB4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ECCP3IE                :1;
        unsigned CCP4IE                 :1;
        unsigned CCP5IE                 :1;
        unsigned CCP6IE                 :1;
        unsigned CCP7IE                 :1;
        unsigned CCP8IE                 :1;
        unsigned CCP9IE                 :1;
        unsigned CCP10IE                :1;
    };
} PIE4bits_t;
extern volatile PIE4bits_t PIE4bits __at(0xFB4);
// bitfield macros
#define _PIE4_ECCP3IE_POSN                                  0x0
#define _PIE4_ECCP3IE_POSITION                              0x0
#define _PIE4_ECCP3IE_SIZE                                  0x1
#define _PIE4_ECCP3IE_LENGTH                                0x1
#define _PIE4_ECCP3IE_MASK                                  0x1
#define _PIE4_CCP4IE_POSN                                   0x1
#define _PIE4_CCP4IE_POSITION                               0x1
#define _PIE4_CCP4IE_SIZE                                   0x1
#define _PIE4_CCP4IE_LENGTH                                 0x1
#define _PIE4_CCP4IE_MASK                                   0x2
#define _PIE4_CCP5IE_POSN                                   0x2
#define _PIE4_CCP5IE_POSITION                               0x2
#define _PIE4_CCP5IE_SIZE                                   0x1
#define _PIE4_CCP5IE_LENGTH                                 0x1
#define _PIE4_CCP5IE_MASK                                   0x4
#define _PIE4_CCP6IE_POSN                                   0x3
#define _PIE4_CCP6IE_POSITION                               0x3
#define _PIE4_CCP6IE_SIZE                                   0x1
#define _PIE4_CCP6IE_LENGTH                                 0x1
#define _PIE4_CCP6IE_MASK                                   0x8
#define _PIE4_CCP7IE_POSN                                   0x4
#define _PIE4_CCP7IE_POSITION                               0x4
#define _PIE4_CCP7IE_SIZE                                   0x1
#define _PIE4_CCP7IE_LENGTH                                 0x1
#define _PIE4_CCP7IE_MASK                                   0x10
#define _PIE4_CCP8IE_POSN                                   0x5
#define _PIE4_CCP8IE_POSITION                               0x5
#define _PIE4_CCP8IE_SIZE                                   0x1
#define _PIE4_CCP8IE_LENGTH                                 0x1
#define _PIE4_CCP8IE_MASK                                   0x20
#define _PIE4_CCP9IE_POSN                                   0x6
#define _PIE4_CCP9IE_POSITION                               0x6
#define _PIE4_CCP9IE_SIZE                                   0x1
#define _PIE4_CCP9IE_LENGTH                                 0x1
#define _PIE4_CCP9IE_MASK                                   0x40
#define _PIE4_CCP10IE_POSN                                  0x7
#define _PIE4_CCP10IE_POSITION                              0x7
#define _PIE4_CCP10IE_SIZE                                  0x1
#define _PIE4_CCP10IE_LENGTH                                0x1
#define _PIE4_CCP10IE_MASK                                  0x80

// Register: PIR4
#define PIR4 PIR4
extern volatile unsigned char           PIR4                __at(0xFB5);
#ifndef _LIB_BUILD
asm("PIR4 equ 0FB5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ECCP3IF                :1;
        unsigned CCP4IF                 :1;
        unsigned CCP5IF                 :1;
        unsigned CCP6IF                 :1;
        unsigned CCP7IF                 :1;
        unsigned CCP8IF                 :1;
        unsigned CCP9IF                 :1;
        unsigned CCP10IF                :1;
    };
} PIR4bits_t;
extern volatile PIR4bits_t PIR4bits __at(0xFB5);
// bitfield macros
#define _PIR4_ECCP3IF_POSN                                  0x0
#define _PIR4_ECCP3IF_POSITION                              0x0
#define _PIR4_ECCP3IF_SIZE                                  0x1
#define _PIR4_ECCP3IF_LENGTH                                0x1
#define _PIR4_ECCP3IF_MASK                                  0x1
#define _PIR4_CCP4IF_POSN                                   0x1
#define _PIR4_CCP4IF_POSITION                               0x1
#define _PIR4_CCP4IF_SIZE                                   0x1
#define _PIR4_CCP4IF_LENGTH                                 0x1
#define _PIR4_CCP4IF_MASK                                   0x2
#define _PIR4_CCP5IF_POSN                                   0x2
#define _PIR4_CCP5IF_POSITION                               0x2
#define _PIR4_CCP5IF_SIZE                                   0x1
#define _PIR4_CCP5IF_LENGTH                                 0x1
#define _PIR4_CCP5IF_MASK                                   0x4
#define _PIR4_CCP6IF_POSN                                   0x3
#define _PIR4_CCP6IF_POSITION                               0x3
#define _PIR4_CCP6IF_SIZE                                   0x1
#define _PIR4_CCP6IF_LENGTH                                 0x1
#define _PIR4_CCP6IF_MASK                                   0x8
#define _PIR4_CCP7IF_POSN                                   0x4
#define _PIR4_CCP7IF_POSITION                               0x4
#define _PIR4_CCP7IF_SIZE                                   0x1
#define _PIR4_CCP7IF_LENGTH                                 0x1
#define _PIR4_CCP7IF_MASK                                   0x10
#define _PIR4_CCP8IF_POSN                                   0x5
#define _PIR4_CCP8IF_POSITION                               0x5
#define _PIR4_CCP8IF_SIZE                                   0x1
#define _PIR4_CCP8IF_LENGTH                                 0x1
#define _PIR4_CCP8IF_MASK                                   0x20
#define _PIR4_CCP9IF_POSN                                   0x6
#define _PIR4_CCP9IF_POSITION                               0x6
#define _PIR4_CCP9IF_SIZE                                   0x1
#define _PIR4_CCP9IF_LENGTH                                 0x1
#define _PIR4_CCP9IF_MASK                                   0x40
#define _PIR4_CCP10IF_POSN                                  0x7
#define _PIR4_CCP10IF_POSITION                              0x7
#define _PIR4_CCP10IF_SIZE                                  0x1
#define _PIR4_CCP10IF_LENGTH                                0x1
#define _PIR4_CCP10IF_MASK                                  0x80

