MikroElektronika/core_packages/PIC/XC8/def/PIC18F85J94/mcu.h
extern volatile __bit                   CHH20               __at(0x7404);	// @ (0xE80 * 8 + 4)
#define                                 CHH20_bit           _BIT_ACCESS(ADCHIT1L,4)
// ADCHIT1L<CHH21>
extern volatile __bit                   CHH21               __at(0x7405);	// @ (0xE80 * 8 + 5)
#define                                 CHH21_bit           _BIT_ACCESS(ADCHIT1L,5)
// ADCHIT1L<CHH22>
extern volatile __bit                   CHH22               __at(0x7406);	// @ (0xE80 * 8 + 6)
#define                                 CHH22_bit           _BIT_ACCESS(ADCHIT1L,6)
// ADCHIT1L<CHH23>
extern volatile __bit                   CHH23               __at(0x7407);	// @ (0xE80 * 8 + 7)
#define                                 CHH23_bit           _BIT_ACCESS(ADCHIT1L,7)
// ADCHIT1H<CHH24>
extern volatile __bit                   CHH24               __at(0x7408);	// @ (0xE81 * 8 + 0)
#define                                 CHH24_bit           _BIT_ACCESS(ADCHIT1H,0)
// ADCHIT1H<CHH25>
extern volatile __bit                   CHH25               __at(0x7409);	// @ (0xE81 * 8 + 1)
#define                                 CHH25_bit           _BIT_ACCESS(ADCHIT1H,1)
// ADCHIT1H<CHH26>
extern volatile __bit                   CHH26               __at(0x740A);	// @ (0xE81 * 8 + 2)
#define                                 CHH26_bit           _BIT_ACCESS(ADCHIT1H,2)
// ADCHIT1H<CHH27>
extern volatile __bit                   CHH27               __at(0x740B);	// @ (0xE81 * 8 + 3)
#define                                 CHH27_bit           _BIT_ACCESS(ADCHIT1H,3)
// ADCHIT1H<CHH28>
extern volatile __bit                   CHH28               __at(0x740C);	// @ (0xE81 * 8 + 4)
#define                                 CHH28_bit           _BIT_ACCESS(ADCHIT1H,4)
// ADCHIT1H<CHH29>
extern volatile __bit                   CHH29               __at(0x740D);	// @ (0xE81 * 8 + 5)
#define                                 CHH29_bit           _BIT_ACCESS(ADCHIT1H,5)
// ADCHIT0L<CHH3>
extern volatile __bit                   CHH3                __at(0x73F3);	// @ (0xE7E * 8 + 3)
#define                                 CHH3_bit            _BIT_ACCESS(ADCHIT0L,3)
// ADCHIT1H<CHH30>
extern volatile __bit                   CHH30               __at(0x740E);	// @ (0xE81 * 8 + 6)
#define                                 CHH30_bit           _BIT_ACCESS(ADCHIT1H,6)
// ADCHIT0L<CHH4>
extern volatile __bit                   CHH4                __at(0x73F4);	// @ (0xE7E * 8 + 4)
#define                                 CHH4_bit            _BIT_ACCESS(ADCHIT0L,4)
// ADCHIT0L<CHH5>
extern volatile __bit                   CHH5                __at(0x73F5);	// @ (0xE7E * 8 + 5)
#define                                 CHH5_bit            _BIT_ACCESS(ADCHIT0L,5)
// ADCHIT0L<CHH6>
extern volatile __bit                   CHH6                __at(0x73F6);	// @ (0xE7E * 8 + 6)
#define                                 CHH6_bit            _BIT_ACCESS(ADCHIT0L,6)
// ADCHIT0L<CHH7>
extern volatile __bit                   CHH7                __at(0x73F7);	// @ (0xE7E * 8 + 7)
#define                                 CHH7_bit            _BIT_ACCESS(ADCHIT0L,7)
// ADCHIT0H<CHH8>
extern volatile __bit                   CHH8                __at(0x73F8);	// @ (0xE7F * 8 + 0)
#define                                 CHH8_bit            _BIT_ACCESS(ADCHIT0H,0)
// ADCHIT0H<CHH9>
extern volatile __bit                   CHH9                __at(0x73F9);	// @ (0xE7F * 8 + 1)
#define                                 CHH9_bit            _BIT_ACCESS(ADCHIT0H,1)
// ALRMCFG<CHIME>
extern volatile __bit                   CHIME               __at(0x7ADE);	// @ (0xF5B * 8 + 6)
#define                                 CHIME_bit           _BIT_ACCESS(ALRMCFG,6)
// SSP1STAT<CKE1>
extern volatile __bit                   CKE1                __at(0x7E3E);	// @ (0xFC7 * 8 + 6)
#define                                 CKE1_bit            _BIT_ACCESS(SSP1STAT,6)
// SSP2STAT<CKE2>
extern volatile __bit                   CKE2                __at(0x78D6);	// @ (0xF1A * 8 + 6)
#define                                 CKE2_bit            _BIT_ACCESS(SSP2STAT,6)
// SSP1CON1<CKP1>
extern volatile __bit                   CKP1                __at(0x7E34);	// @ (0xFC6 * 8 + 4)
#define                                 CKP1_bit            _BIT_ACCESS(SSP1CON1,4)
// SSP2CON1<CKP2>
extern volatile __bit                   CKP2                __at(0x78CC);	// @ (0xF19 * 8 + 4)
#define                                 CKP2_bit            _BIT_ACCESS(SSP2CON1,4)
// BAUDCON1<CKTXP>
extern volatile __bit                   CKTXP               __at(0x7B3C);	// @ (0xF67 * 8 + 4)
#define                                 CKTXP_bit           _BIT_ACCESS(BAUDCON1,4)
// OSCCON2<CLKLOCK>
extern volatile __bit                   CLKLOCK             __at(0x7B37);	// @ (0xF66 * 8 + 7)
#define                                 CLKLOCK_bit         _BIT_ACCESS(OSCCON2,7)
// LCDREG<CLKSEL0>
extern volatile __bit                   CLKSEL0             __at(0x76C0);	// @ (0xED8 * 8 + 0)
#define                                 CLKSEL0_bit         _BIT_ACCESS(LCDREG,0)
// LCDREG<CLKSEL1>
extern volatile __bit                   CLKSEL1             __at(0x76C1);	// @ (0xED8 * 8 + 1)
#define                                 CLKSEL1_bit         _BIT_ACCESS(LCDREG,1)
// RCON<CM>
extern volatile __bit                   CM                  __at(0x7E85);	// @ (0xFD0 * 8 + 5)
#define                                 CM_bit              _BIT_ACCESS(RCON,5)
// ADCON5L<CM0>
extern volatile __bit                   CM0                 __at(0x7440);	// @ (0xE88 * 8 + 0)
#define                                 CM0_bit             _BIT_ACCESS(ADCON5L,0)
// ADCON5L<CM1>
extern volatile __bit                   CM1                 __at(0x7441);	// @ (0xE88 * 8 + 1)
#define                                 CM1_bit             _BIT_ACCESS(ADCON5L,1)
// PIE2<CMIE>
extern volatile __bit                   CMIE                __at(0x7D06);	// @ (0xFA0 * 8 + 6)
#define                                 CMIE_bit            _BIT_ACCESS(PIE2,6)
// PIR2<CMIF>
extern volatile __bit                   CMIF                __at(0x7D0E);	// @ (0xFA1 * 8 + 6)
#define                                 CMIF_bit            _BIT_ACCESS(PIR2,6)
// IPR2<CMIP>
extern volatile __bit                   CMIP                __at(0x7D16);	// @ (0xFA2 * 8 + 6)
#define                                 CMIP_bit            _BIT_ACCESS(IPR2,6)
// PIE6<CMP1IE>
extern volatile __bit                   CMP1IE              __at(0x7B08);	// @ (0xF61 * 8 + 0)
#define                                 CMP1IE_bit          _BIT_ACCESS(PIE6,0)
// PIR6<CMP1IF>
extern volatile __bit                   CMP1IF              __at(0x7D30);	// @ (0xFA6 * 8 + 0)
#define                                 CMP1IF_bit          _BIT_ACCESS(PIR6,0)
// IPR6<CMP1IP>
extern volatile __bit                   CMP1IP              __at(0x7D48);	// @ (0xFA9 * 8 + 0)
#define                                 CMP1IP_bit          _BIT_ACCESS(IPR6,0)
// PMD4<CMP1MD>
extern volatile __bit                   CMP1MD              __at(0x7787);	// @ (0xEF0 * 8 + 7)
#define                                 CMP1MD_bit          _BIT_ACCESS(PMD4,7)
// PIE6<CMP2IE>
extern volatile __bit                   CMP2IE              __at(0x7B09);	// @ (0xF61 * 8 + 1)
#define                                 CMP2IE_bit          _BIT_ACCESS(PIE6,1)
// PIR6<CMP2IF>
extern volatile __bit                   CMP2IF              __at(0x7D31);	// @ (0xFA6 * 8 + 1)
#define                                 CMP2IF_bit          _BIT_ACCESS(PIR6,1)
// IPR6<CMP2IP>
extern volatile __bit                   CMP2IP              __at(0x7D49);	// @ (0xFA9 * 8 + 1)
#define                                 CMP2IP_bit          _BIT_ACCESS(IPR6,1)
// PMD4<CMP2MD>
extern volatile __bit                   CMP2MD              __at(0x7786);	// @ (0xEF0 * 8 + 6)
#define                                 CMP2MD_bit          _BIT_ACCESS(PMD4,6)
// PIE6<CMP3IE>
extern volatile __bit                   CMP3IE              __at(0x7B0A);	// @ (0xF61 * 8 + 2)
#define                                 CMP3IE_bit          _BIT_ACCESS(PIE6,2)
// PIR6<CMP3IF>
extern volatile __bit                   CMP3IF              __at(0x7D32);	// @ (0xFA6 * 8 + 2)
#define                                 CMP3IF_bit          _BIT_ACCESS(PIR6,2)
// IPR6<CMP3IP>
extern volatile __bit                   CMP3IP              __at(0x7D4A);	// @ (0xFA9 * 8 + 2)
#define                                 CMP3IP_bit          _BIT_ACCESS(IPR6,2)
// PMD4<CMP3MD>
extern volatile __bit                   CMP3MD              __at(0x7785);	// @ (0xEF0 * 8 + 5)
#define                                 CMP3MD_bit          _BIT_ACCESS(PMD4,5)
// PSTR1CON<CMPL01>
extern volatile __bit                   CMPL01              __at(0x7CE6);	// @ (0xF9C * 8 + 6)
#define                                 CMPL01_bit          _BIT_ACCESS(PSTR1CON,6)
// PSTR2CON<CMPL02>
extern volatile __bit                   CMPL02              __at(0x78E6);	// @ (0xF1C * 8 + 6)
#define                                 CMPL02_bit          _BIT_ACCESS(PSTR2CON,6)
// PSTR3CON<CMPL03>
extern volatile __bit                   CMPL03              __at(0x78DE);	// @ (0xF1B * 8 + 6)
#define                                 CMPL03_bit          _BIT_ACCESS(PSTR3CON,6)
// PSTR1CON<CMPL11>
extern volatile __bit                   CMPL11              __at(0x7CE7);	// @ (0xF9C * 8 + 7)
#define                                 CMPL11_bit          _BIT_ACCESS(PSTR1CON,7)
// PSTR2CON<CMPL12>
extern volatile __bit                   CMPL12              __at(0x78E7);	// @ (0xF1C * 8 + 7)
#define                                 CMPL12_bit          _BIT_ACCESS(PSTR2CON,7)
// PSTR3CON<CMPL13>
extern volatile __bit                   CMPL13              __at(0x78DF);	// @ (0xF1B * 8 + 7)
#define                                 CMPL13_bit          _BIT_ACCESS(PSTR3CON,7)
// CM1CON<COE1>
extern volatile __bit                   COE1                __at(0x7A9E);	// @ (0xF53 * 8 + 6)
#define                                 COE1_bit            _BIT_ACCESS(CM1CON,6)
// CM2CON<COE2>
extern volatile __bit                   COE2                __at(0x79C6);	// @ (0xF38 * 8 + 6)
#define                                 COE2_bit            _BIT_ACCESS(CM2CON,6)
// CM3CON<COE3>
extern volatile __bit                   COE3                __at(0x79BE);	// @ (0xF37 * 8 + 6)
#define                                 COE3_bit            _BIT_ACCESS(CM3CON,6)
// CM1CON<CON1>
extern volatile __bit                   CON1                __at(0x7A9F);	// @ (0xF53 * 8 + 7)
#define                                 CON1_bit            _BIT_ACCESS(CM1CON,7)
// CM2CON<CON2>
extern volatile __bit                   CON2                __at(0x79C7);	// @ (0xF38 * 8 + 7)
#define                                 CON2_bit            _BIT_ACCESS(CM2CON,7)
// CM3CON<CON3>
extern volatile __bit                   CON3                __at(0x79BF);	// @ (0xF37 * 8 + 7)
#define                                 CON3_bit            _BIT_ACCESS(CM3CON,7)
// OSCCON<COSC0>
extern volatile __bit                   COSC0               __at(0x7E9C);	// @ (0xFD3 * 8 + 4)
#define                                 COSC0_bit           _BIT_ACCESS(OSCCON,4)
// OSCCON<COSC1>
extern volatile __bit                   COSC1               __at(0x7E9D);	// @ (0xFD3 * 8 + 5)
#define                                 COSC1_bit           _BIT_ACCESS(OSCCON,5)
// OSCCON<COSC2>
extern volatile __bit                   COSC2               __at(0x7E9E);	// @ (0xFD3 * 8 + 6)
#define                                 COSC2_bit           _BIT_ACCESS(OSCCON,6)
// OSCCON4<CPDIV0>
extern volatile __bit                   CPDIV0              __at(0x7B26);	// @ (0xF64 * 8 + 6)
#define                                 CPDIV0_bit          _BIT_ACCESS(OSCCON4,6)
// OSCCON4<CPDIV1>
extern volatile __bit                   CPDIV1              __at(0x7B27);	// @ (0xF64 * 8 + 7)
#define                                 CPDIV1_bit          _BIT_ACCESS(OSCCON4,7)
// LCDREG<CPEN>
extern volatile __bit                   CPEN                __at(0x76C7);	// @ (0xED8 * 8 + 7)
#define                                 CPEN_bit            _BIT_ACCESS(LCDREG,7)
// CM1CON<CPOL1>
extern volatile __bit                   CPOL1               __at(0x7A9D);	// @ (0xF53 * 8 + 5)
#define                                 CPOL1_bit           _BIT_ACCESS(CM1CON,5)
// CM2CON<CPOL2>
extern volatile __bit                   CPOL2               __at(0x79C5);	// @ (0xF38 * 8 + 5)
#define                                 CPOL2_bit           _BIT_ACCESS(CM2CON,5)
// CM3CON<CPOL3>
extern volatile __bit                   CPOL3               __at(0x79BD);	// @ (0xF37 * 8 + 5)
#define                                 CPOL3_bit           _BIT_ACCESS(CM3CON,5)
// UEIE<CRC16EE>
extern volatile __bit                   CRC16EE             __at(0x707A);	// @ (0xE0F * 8 + 2)
#define                                 CRC16EE_bit         _BIT_ACCESS(UEIE,2)
// UEIR<CRC16EF>
extern volatile __bit                   CRC16EF             __at(0x7BBA);	// @ (0xF77 * 8 + 2)
#define                                 CRC16EF_bit         _BIT_ACCESS(UEIR,2)
// UEIE<CRC5EE>
extern volatile __bit                   CRC5EE              __at(0x7079);	// @ (0xE0F * 8 + 1)
#define                                 CRC5EE_bit          _BIT_ACCESS(UEIE,1)
// UEIR<CRC5EF>
extern volatile __bit                   CRC5EF              __at(0x7BB9);	// @ (0xF77 * 8 + 1)
#define                                 CRC5EF_bit          _BIT_ACCESS(UEIR,1)
// CM1CON<CREF1>
extern volatile __bit                   CREF1               __at(0x7A9A);	// @ (0xF53 * 8 + 2)
#define                                 CREF1_bit           _BIT_ACCESS(CM1CON,2)
// CM2CON<CREF2>
extern volatile __bit                   CREF2               __at(0x79C2);	// @ (0xF38 * 8 + 2)
#define                                 CREF2_bit           _BIT_ACCESS(CM2CON,2)
// CM3CON<CREF3>
extern volatile __bit                   CREF3               __at(0x79BA);	// @ (0xF37 * 8 + 2)
#define                                 CREF3_bit           _BIT_ACCESS(CM3CON,2)
// PORTE<CS>
extern volatile __bit                   CS                  __at(0x7C22);	// @ (0xF84 * 8 + 2)
#define                                 CS_bit              _BIT_ACCESS(PORTE,2)
// LCDCON<CS0>
extern volatile __bit                   CS0                 __at(0x76CB);	// @ (0xED9 * 8 + 3)
#define                                 CS0_bit             _BIT_ACCESS(LCDCON,3)
// LCDCON<CS1>
extern volatile __bit                   CS1                 __at(0x76CC);	// @ (0xED9 * 8 + 4)
#define                                 CS1_bit             _BIT_ACCESS(LCDCON,4)
// ADCON2H<CSCNA>
extern volatile __bit                   CSCNA               __at(0x746A);	// @ (0xE8D * 8 + 2)
#define                                 CSCNA_bit           _BIT_ACCESS(ADCON2H,2)
// TXSTA1<CSRC1>
extern volatile __bit                   CSRC1               __at(0x7D67);	// @ (0xFAC * 8 + 7)
#define                                 CSRC1_bit           _BIT_ACCESS(TXSTA1,7)
// ADCSS0L<CSS0>
extern volatile __bit                   CSS0                __at(0x7410);	// @ (0xE82 * 8 + 0)
#define                                 CSS0_bit            _BIT_ACCESS(ADCSS0L,0)
// ADCSS0L<CSS1>
extern volatile __bit                   CSS1                __at(0x7411);	// @ (0xE82 * 8 + 1)
#define                                 CSS1_bit            _BIT_ACCESS(ADCSS0L,1)
// ADCSS0H<CSS10>
extern volatile __bit                   CSS10               __at(0x741A);	// @ (0xE83 * 8 + 2)
#define                                 CSS10_bit           _BIT_ACCESS(ADCSS0H,2)
// ADCSS0H<CSS11>
extern volatile __bit                   CSS11               __at(0x741B);	// @ (0xE83 * 8 + 3)
#define                                 CSS11_bit           _BIT_ACCESS(ADCSS0H,3)
// ADCSS0H<CSS12>
extern volatile __bit                   CSS12               __at(0x741C);	// @ (0xE83 * 8 + 4)
#define                                 CSS12_bit           _BIT_ACCESS(ADCSS0H,4)
// ADCSS0H<CSS13>
extern volatile __bit                   CSS13               __at(0x741D);	// @ (0xE83 * 8 + 5)
#define                                 CSS13_bit           _BIT_ACCESS(ADCSS0H,5)
// ADCSS0H<CSS14>
extern volatile __bit                   CSS14               __at(0x741E);	// @ (0xE83 * 8 + 6)
#define                                 CSS14_bit           _BIT_ACCESS(ADCSS0H,6)
// ADCSS0H<CSS15>
extern volatile __bit                   CSS15               __at(0x741F);	// @ (0xE83 * 8 + 7)
#define                                 CSS15_bit           _BIT_ACCESS(ADCSS0H,7)
// ADCSS1L<CSS16>
extern volatile __bit                   CSS16               __at(0x7420);	// @ (0xE84 * 8 + 0)
#define                                 CSS16_bit           _BIT_ACCESS(ADCSS1L,0)
// ADCSS1L<CSS17>
extern volatile __bit                   CSS17               __at(0x7421);	// @ (0xE84 * 8 + 1)
#define                                 CSS17_bit           _BIT_ACCESS(ADCSS1L,1)
// ADCSS1L<CSS18>
extern volatile __bit                   CSS18               __at(0x7422);	// @ (0xE84 * 8 + 2)
#define                                 CSS18_bit           _BIT_ACCESS(ADCSS1L,2)
// ADCSS1L<CSS19>
extern volatile __bit                   CSS19               __at(0x7423);	// @ (0xE84 * 8 + 3)
#define                                 CSS19_bit           _BIT_ACCESS(ADCSS1L,3)
// ADCSS0L<CSS2>
extern volatile __bit                   CSS2                __at(0x7412);	// @ (0xE82 * 8 + 2)
#define                                 CSS2_bit            _BIT_ACCESS(ADCSS0L,2)
// ADCSS1L<CSS20>
extern volatile __bit                   CSS20               __at(0x7424);	// @ (0xE84 * 8 + 4)
#define                                 CSS20_bit           _BIT_ACCESS(ADCSS1L,4)
// ADCSS1L<CSS21>
extern volatile __bit                   CSS21               __at(0x7425);	// @ (0xE84 * 8 + 5)
#define                                 CSS21_bit           _BIT_ACCESS(ADCSS1L,5)
// ADCSS1L<CSS22>
extern volatile __bit                   CSS22               __at(0x7426);	// @ (0xE84 * 8 + 6)
#define                                 CSS22_bit           _BIT_ACCESS(ADCSS1L,6)
// ADCSS1L<CSS23>
extern volatile __bit                   CSS23               __at(0x7427);	// @ (0xE84 * 8 + 7)
#define                                 CSS23_bit           _BIT_ACCESS(ADCSS1L,7)
// ADCSS1H<CSS24>
extern volatile __bit                   CSS24               __at(0x7428);	// @ (0xE85 * 8 + 0)
#define                                 CSS24_bit           _BIT_ACCESS(ADCSS1H,0)
// ADCSS1H<CSS25>
extern volatile __bit                   CSS25               __at(0x7429);	// @ (0xE85 * 8 + 1)
#define                                 CSS25_bit           _BIT_ACCESS(ADCSS1H,1)
// ADCSS1H<CSS26>
extern volatile __bit                   CSS26               __at(0x742A);	// @ (0xE85 * 8 + 2)
#define                                 CSS26_bit           _BIT_ACCESS(ADCSS1H,2)
// ADCSS1H<CSS27>
extern volatile __bit                   CSS27               __at(0x742B);	// @ (0xE85 * 8 + 3)
#define                                 CSS27_bit           _BIT_ACCESS(ADCSS1H,3)
// ADCSS1H<CSS28>
extern volatile __bit                   CSS28               __at(0x742C);	// @ (0xE85 * 8 + 4)
#define                                 CSS28_bit           _BIT_ACCESS(ADCSS1H,4)
// ADCSS1H<CSS29>
extern volatile __bit                   CSS29               __at(0x742D);	// @ (0xE85 * 8 + 5)
#define                                 CSS29_bit           _BIT_ACCESS(ADCSS1H,5)
// ADCSS0L<CSS3>
extern volatile __bit                   CSS3                __at(0x7413);	// @ (0xE82 * 8 + 3)
#define                                 CSS3_bit            _BIT_ACCESS(ADCSS0L,3)
// ADCSS1H<CSS30>
extern volatile __bit                   CSS30               __at(0x742E);	// @ (0xE85 * 8 + 6)
#define                                 CSS30_bit           _BIT_ACCESS(ADCSS1H,6)
// ADCSS0L<CSS4>
extern volatile __bit                   CSS4                __at(0x7414);	// @ (0xE82 * 8 + 4)
#define                                 CSS4_bit            _BIT_ACCESS(ADCSS0L,4)
// ADCSS0L<CSS5>
extern volatile __bit                   CSS5                __at(0x7415);	// @ (0xE82 * 8 + 5)
#define                                 CSS5_bit            _BIT_ACCESS(ADCSS0L,5)
// ADCSS0L<CSS6>
extern volatile __bit                   CSS6                __at(0x7416);	// @ (0xE82 * 8 + 6)
#define                                 CSS6_bit            _BIT_ACCESS(ADCSS0L,6)
// ADCSS0L<CSS7>
extern volatile __bit                   CSS7                __at(0x7417);	// @ (0xE82 * 8 + 7)
#define                                 CSS7_bit            _BIT_ACCESS(ADCSS0L,7)
// ADCSS0H<CSS8>
extern volatile __bit                   CSS8                __at(0x7418);	// @ (0xE83 * 8 + 0)
#define                                 CSS8_bit            _BIT_ACCESS(ADCSS0H,0)
// ADCSS0H<CSS9>
extern volatile __bit                   CSS9                __at(0x7419);	// @ (0xE83 * 8 + 1)
#define                                 CSS9_bit            _BIT_ACCESS(ADCSS0H,1)
// CTMUCON1<CTMUEN>
extern volatile __bit                   CTMUEN              __at(0x77C7);	// @ (0xEF8 * 8 + 7)
#define                                 CTMUEN_bit          _BIT_ACCESS(CTMUCON1,7)
// ADCTMUEN0L<CTMUEN0>
extern volatile __bit                   CTMUEN0             __at(0x73D0);	// @ (0xE7A * 8 + 0)
#define                                 CTMUEN0_bit         _BIT_ACCESS(ADCTMUEN0L,0)
// ADCTMUEN0L<CTMUEN1>
extern volatile __bit                   CTMUEN1             __at(0x73D1);	// @ (0xE7A * 8 + 1)
#define                                 CTMUEN1_bit         _BIT_ACCESS(ADCTMUEN0L,1)
// ADCTMUEN0H<CTMUEN10>
extern volatile __bit                   CTMUEN10            __at(0x73DA);	// @ (0xE7B * 8 + 2)
#define                                 CTMUEN10_bit        _BIT_ACCESS(ADCTMUEN0H,2)
// ADCTMUEN0H<CTMUEN11>
extern volatile __bit                   CTMUEN11            __at(0x73DB);	// @ (0xE7B * 8 + 3)
#define                                 CTMUEN11_bit        _BIT_ACCESS(ADCTMUEN0H,3)
// ADCTMUEN0H<CTMUEN12>
extern volatile __bit                   CTMUEN12            __at(0x73DC);	// @ (0xE7B * 8 + 4)
#define                                 CTMUEN12_bit        _BIT_ACCESS(ADCTMUEN0H,4)
// ADCTMUEN0H<CTMUEN13>
extern volatile __bit                   CTMUEN13            __at(0x73DD);	// @ (0xE7B * 8 + 5)
#define                                 CTMUEN13_bit        _BIT_ACCESS(ADCTMUEN0H,5)
// ADCTMUEN0H<CTMUEN14>
extern volatile __bit                   CTMUEN14            __at(0x73DE);	// @ (0xE7B * 8 + 6)
#define                                 CTMUEN14_bit        _BIT_ACCESS(ADCTMUEN0H,6)
// ADCTMUEN0H<CTMUEN15>
extern volatile __bit                   CTMUEN15            __at(0x73DF);	// @ (0xE7B * 8 + 7)
#define                                 CTMUEN15_bit        _BIT_ACCESS(ADCTMUEN0H,7)
// ADCTMUEN0L<CTMUEN2>
extern volatile __bit                   CTMUEN2             __at(0x73D2);	// @ (0xE7A * 8 + 2)
#define                                 CTMUEN2_bit         _BIT_ACCESS(ADCTMUEN0L,2)
// ADCTMUEN1L<CTMUEN20>
extern volatile __bit                   CTMUEN20            __at(0x73E4);	// @ (0xE7C * 8 + 4)
#define                                 CTMUEN20_bit        _BIT_ACCESS(ADCTMUEN1L,4)
// ADCTMUEN1L<CTMUEN21>
extern volatile __bit                   CTMUEN21            __at(0x73E5);	// @ (0xE7C * 8 + 5)
#define                                 CTMUEN21_bit        _BIT_ACCESS(ADCTMUEN1L,5)
// ADCTMUEN1L<CTMUEN22>
extern volatile __bit                   CTMUEN22            __at(0x73E6);	// @ (0xE7C * 8 + 6)
#define                                 CTMUEN22_bit        _BIT_ACCESS(ADCTMUEN1L,6)
// ADCTMUEN1L<CTMUEN23>
extern volatile __bit                   CTMUEN23            __at(0x73E7);	// @ (0xE7C * 8 + 7)
