MikroElektronika/core_packages/PIC/XC8/def/PIC18F85J94/mcu.h
extern volatile __bit                   R_W1                __at(0x7E3A);	// @ (0xFC7 * 8 + 2)
#define                                 R_W1_bit            _BIT_ACCESS(SSP1STAT,2)
// SSP2STAT<R_W2>
extern volatile __bit                   R_W2                __at(0x78D2);	// @ (0xF1A * 8 + 2)
#define                                 R_W2_bit            _BIT_ACCESS(SSP2STAT,2)
// SSP1STAT<R_nW1>
extern volatile __bit                   R_nW1               __at(0x7E3A);	// @ (0xFC7 * 8 + 2)
#define                                 R_nW1_bit           _BIT_ACCESS(SSP1STAT,2)
// SSP2STAT<R_nW2>
extern volatile __bit                   R_nW2               __at(0x78D2);	// @ (0xF1A * 8 + 2)
#define                                 R_nW2_bit           _BIT_ACCESS(SSP2STAT,2)
// LCDDATA0<S00C0>
extern volatile __bit                   S00C0               __at(0x7470);	// @ (0xE8E * 8 + 0)
#define                                 S00C0_bit           _BIT_ACCESS(LCDDATA0,0)
// LCDDATA8<S00C1>
extern volatile __bit                   S00C1               __at(0x74B0);	// @ (0xE96 * 8 + 0)
#define                                 S00C1_bit           _BIT_ACCESS(LCDDATA8,0)
// LCDDATA16<S00C2>
extern volatile __bit                   S00C2               __at(0x74F0);	// @ (0xE9E * 8 + 0)
#define                                 S00C2_bit           _BIT_ACCESS(LCDDATA16,0)
// LCDDATA24<S00C3>
extern volatile __bit                   S00C3               __at(0x7530);	// @ (0xEA6 * 8 + 0)
#define                                 S00C3_bit           _BIT_ACCESS(LCDDATA24,0)
// LCDDATA32<S00C4>
extern volatile __bit                   S00C4               __at(0x7570);	// @ (0xEAE * 8 + 0)
#define                                 S00C4_bit           _BIT_ACCESS(LCDDATA32,0)
// LCDDATA40<S00C5>
extern volatile __bit                   S00C5               __at(0x75B0);	// @ (0xEB6 * 8 + 0)
#define                                 S00C5_bit           _BIT_ACCESS(LCDDATA40,0)
// LCDDATA48<S00C6>
extern volatile __bit                   S00C6               __at(0x75F0);	// @ (0xEBE * 8 + 0)
#define                                 S00C6_bit           _BIT_ACCESS(LCDDATA48,0)
// LCDDATA56<S00C7>
extern volatile __bit                   S00C7               __at(0x7630);	// @ (0xEC6 * 8 + 0)
#define                                 S00C7_bit           _BIT_ACCESS(LCDDATA56,0)
// LCDDATA0<S01C0>
extern volatile __bit                   S01C0               __at(0x7471);	// @ (0xE8E * 8 + 1)
#define                                 S01C0_bit           _BIT_ACCESS(LCDDATA0,1)
// LCDDATA8<S01C1>
extern volatile __bit                   S01C1               __at(0x74B1);	// @ (0xE96 * 8 + 1)
#define                                 S01C1_bit           _BIT_ACCESS(LCDDATA8,1)
// LCDDATA16<S01C2>
extern volatile __bit                   S01C2               __at(0x74F1);	// @ (0xE9E * 8 + 1)
#define                                 S01C2_bit           _BIT_ACCESS(LCDDATA16,1)
// LCDDATA24<S01C3>
extern volatile __bit                   S01C3               __at(0x7531);	// @ (0xEA6 * 8 + 1)
#define                                 S01C3_bit           _BIT_ACCESS(LCDDATA24,1)
// LCDDATA32<S01C4>
extern volatile __bit                   S01C4               __at(0x7571);	// @ (0xEAE * 8 + 1)
#define                                 S01C4_bit           _BIT_ACCESS(LCDDATA32,1)
// LCDDATA40<S01C5>
extern volatile __bit                   S01C5               __at(0x75B1);	// @ (0xEB6 * 8 + 1)
#define                                 S01C5_bit           _BIT_ACCESS(LCDDATA40,1)
// LCDDATA48<S01C6>
extern volatile __bit                   S01C6               __at(0x75F1);	// @ (0xEBE * 8 + 1)
#define                                 S01C6_bit           _BIT_ACCESS(LCDDATA48,1)
// LCDDATA56<S01C7>
extern volatile __bit                   S01C7               __at(0x7631);	// @ (0xEC6 * 8 + 1)
#define                                 S01C7_bit           _BIT_ACCESS(LCDDATA56,1)
// LCDDATA0<S02C0>
extern volatile __bit                   S02C0               __at(0x7472);	// @ (0xE8E * 8 + 2)
#define                                 S02C0_bit           _BIT_ACCESS(LCDDATA0,2)
// LCDDATA8<S02C1>
extern volatile __bit                   S02C1               __at(0x74B2);	// @ (0xE96 * 8 + 2)
#define                                 S02C1_bit           _BIT_ACCESS(LCDDATA8,2)
// LCDDATA16<S02C2>
extern volatile __bit                   S02C2               __at(0x74F2);	// @ (0xE9E * 8 + 2)
#define                                 S02C2_bit           _BIT_ACCESS(LCDDATA16,2)
// LCDDATA24<S02C3>
extern volatile __bit                   S02C3               __at(0x7532);	// @ (0xEA6 * 8 + 2)
#define                                 S02C3_bit           _BIT_ACCESS(LCDDATA24,2)
// LCDDATA32<S02C4>
extern volatile __bit                   S02C4               __at(0x7572);	// @ (0xEAE * 8 + 2)
#define                                 S02C4_bit           _BIT_ACCESS(LCDDATA32,2)
// LCDDATA40<S02C5>
extern volatile __bit                   S02C5               __at(0x75B2);	// @ (0xEB6 * 8 + 2)
#define                                 S02C5_bit           _BIT_ACCESS(LCDDATA40,2)
// LCDDATA48<S02C6>
extern volatile __bit                   S02C6               __at(0x75F2);	// @ (0xEBE * 8 + 2)
#define                                 S02C6_bit           _BIT_ACCESS(LCDDATA48,2)
// LCDDATA56<S02C7>
extern volatile __bit                   S02C7               __at(0x7632);	// @ (0xEC6 * 8 + 2)
#define                                 S02C7_bit           _BIT_ACCESS(LCDDATA56,2)
// LCDDATA0<S03C0>
extern volatile __bit                   S03C0               __at(0x7473);	// @ (0xE8E * 8 + 3)
#define                                 S03C0_bit           _BIT_ACCESS(LCDDATA0,3)
// LCDDATA8<S03C1>
extern volatile __bit                   S03C1               __at(0x74B3);	// @ (0xE96 * 8 + 3)
#define                                 S03C1_bit           _BIT_ACCESS(LCDDATA8,3)
// LCDDATA16<S03C2>
extern volatile __bit                   S03C2               __at(0x74F3);	// @ (0xE9E * 8 + 3)
#define                                 S03C2_bit           _BIT_ACCESS(LCDDATA16,3)
// LCDDATA24<S03C3>
extern volatile __bit                   S03C3               __at(0x7533);	// @ (0xEA6 * 8 + 3)
#define                                 S03C3_bit           _BIT_ACCESS(LCDDATA24,3)
// LCDDATA32<S03C4>
extern volatile __bit                   S03C4               __at(0x7573);	// @ (0xEAE * 8 + 3)
#define                                 S03C4_bit           _BIT_ACCESS(LCDDATA32,3)
// LCDDATA40<S03C5>
extern volatile __bit                   S03C5               __at(0x75B3);	// @ (0xEB6 * 8 + 3)
#define                                 S03C5_bit           _BIT_ACCESS(LCDDATA40,3)
// LCDDATA48<S03C6>
extern volatile __bit                   S03C6               __at(0x75F3);	// @ (0xEBE * 8 + 3)
#define                                 S03C6_bit           _BIT_ACCESS(LCDDATA48,3)
// LCDDATA56<S03C7>
extern volatile __bit                   S03C7               __at(0x7633);	// @ (0xEC6 * 8 + 3)
#define                                 S03C7_bit           _BIT_ACCESS(LCDDATA56,3)
// LCDDATA0<S04C0>
extern volatile __bit                   S04C0               __at(0x7474);	// @ (0xE8E * 8 + 4)
#define                                 S04C0_bit           _BIT_ACCESS(LCDDATA0,4)
// LCDDATA8<S04C1>
extern volatile __bit                   S04C1               __at(0x74B4);	// @ (0xE96 * 8 + 4)
#define                                 S04C1_bit           _BIT_ACCESS(LCDDATA8,4)
// LCDDATA16<S04C2>
extern volatile __bit                   S04C2               __at(0x74F4);	// @ (0xE9E * 8 + 4)
#define                                 S04C2_bit           _BIT_ACCESS(LCDDATA16,4)
// LCDDATA24<S04C3>
extern volatile __bit                   S04C3               __at(0x7534);	// @ (0xEA6 * 8 + 4)
#define                                 S04C3_bit           _BIT_ACCESS(LCDDATA24,4)
// LCDDATA32<S04C4>
extern volatile __bit                   S04C4               __at(0x7574);	// @ (0xEAE * 8 + 4)
#define                                 S04C4_bit           _BIT_ACCESS(LCDDATA32,4)
// LCDDATA40<S04C5>
extern volatile __bit                   S04C5               __at(0x75B4);	// @ (0xEB6 * 8 + 4)
#define                                 S04C5_bit           _BIT_ACCESS(LCDDATA40,4)
// LCDDATA48<S04C6>
extern volatile __bit                   S04C6               __at(0x75F4);	// @ (0xEBE * 8 + 4)
#define                                 S04C6_bit           _BIT_ACCESS(LCDDATA48,4)
// LCDDATA56<S04C7>
extern volatile __bit                   S04C7               __at(0x7634);	// @ (0xEC6 * 8 + 4)
#define                                 S04C7_bit           _BIT_ACCESS(LCDDATA56,4)
// LCDDATA0<S05C0>
extern volatile __bit                   S05C0               __at(0x7475);	// @ (0xE8E * 8 + 5)
#define                                 S05C0_bit           _BIT_ACCESS(LCDDATA0,5)
// LCDDATA8<S05C1>
extern volatile __bit                   S05C1               __at(0x74B5);	// @ (0xE96 * 8 + 5)
#define                                 S05C1_bit           _BIT_ACCESS(LCDDATA8,5)
// LCDDATA16<S05C2>
extern volatile __bit                   S05C2               __at(0x74F5);	// @ (0xE9E * 8 + 5)
#define                                 S05C2_bit           _BIT_ACCESS(LCDDATA16,5)
// LCDDATA24<S05C3>
extern volatile __bit                   S05C3               __at(0x7535);	// @ (0xEA6 * 8 + 5)
#define                                 S05C3_bit           _BIT_ACCESS(LCDDATA24,5)
// LCDDATA32<S05C4>
extern volatile __bit                   S05C4               __at(0x7575);	// @ (0xEAE * 8 + 5)
#define                                 S05C4_bit           _BIT_ACCESS(LCDDATA32,5)
// LCDDATA40<S05C5>
extern volatile __bit                   S05C5               __at(0x75B5);	// @ (0xEB6 * 8 + 5)
#define                                 S05C5_bit           _BIT_ACCESS(LCDDATA40,5)
// LCDDATA48<S05C6>
extern volatile __bit                   S05C6               __at(0x75F5);	// @ (0xEBE * 8 + 5)
#define                                 S05C6_bit           _BIT_ACCESS(LCDDATA48,5)
// LCDDATA56<S05C7>
extern volatile __bit                   S05C7               __at(0x7635);	// @ (0xEC6 * 8 + 5)
#define                                 S05C7_bit           _BIT_ACCESS(LCDDATA56,5)
// LCDDATA0<S06C0>
extern volatile __bit                   S06C0               __at(0x7476);	// @ (0xE8E * 8 + 6)
#define                                 S06C0_bit           _BIT_ACCESS(LCDDATA0,6)
// LCDDATA8<S06C1>
extern volatile __bit                   S06C1               __at(0x74B6);	// @ (0xE96 * 8 + 6)
#define                                 S06C1_bit           _BIT_ACCESS(LCDDATA8,6)
// LCDDATA16<S06C2>
extern volatile __bit                   S06C2               __at(0x74F6);	// @ (0xE9E * 8 + 6)
#define                                 S06C2_bit           _BIT_ACCESS(LCDDATA16,6)
// LCDDATA24<S06C3>
extern volatile __bit                   S06C3               __at(0x7536);	// @ (0xEA6 * 8 + 6)
#define                                 S06C3_bit           _BIT_ACCESS(LCDDATA24,6)
// LCDDATA32<S06C4>
extern volatile __bit                   S06C4               __at(0x7576);	// @ (0xEAE * 8 + 6)
#define                                 S06C4_bit           _BIT_ACCESS(LCDDATA32,6)
// LCDDATA40<S06C5>
extern volatile __bit                   S06C5               __at(0x75B6);	// @ (0xEB6 * 8 + 6)
#define                                 S06C5_bit           _BIT_ACCESS(LCDDATA40,6)
// LCDDATA48<S06C6>
extern volatile __bit                   S06C6               __at(0x75F6);	// @ (0xEBE * 8 + 6)
#define                                 S06C6_bit           _BIT_ACCESS(LCDDATA48,6)
// LCDDATA56<S06C7>
extern volatile __bit                   S06C7               __at(0x7636);	// @ (0xEC6 * 8 + 6)
#define                                 S06C7_bit           _BIT_ACCESS(LCDDATA56,6)
// LCDDATA0<S07C0>
extern volatile __bit                   S07C0               __at(0x7477);	// @ (0xE8E * 8 + 7)
#define                                 S07C0_bit           _BIT_ACCESS(LCDDATA0,7)
// LCDDATA8<S07C1>
extern volatile __bit                   S07C1               __at(0x74B7);	// @ (0xE96 * 8 + 7)
#define                                 S07C1_bit           _BIT_ACCESS(LCDDATA8,7)
// LCDDATA16<S07C2>
extern volatile __bit                   S07C2               __at(0x74F7);	// @ (0xE9E * 8 + 7)
#define                                 S07C2_bit           _BIT_ACCESS(LCDDATA16,7)
// LCDDATA24<S07C3>
extern volatile __bit                   S07C3               __at(0x7537);	// @ (0xEA6 * 8 + 7)
#define                                 S07C3_bit           _BIT_ACCESS(LCDDATA24,7)
// LCDDATA32<S07C4>
extern volatile __bit                   S07C4               __at(0x7577);	// @ (0xEAE * 8 + 7)
#define                                 S07C4_bit           _BIT_ACCESS(LCDDATA32,7)
// LCDDATA40<S07C5>
extern volatile __bit                   S07C5               __at(0x75B7);	// @ (0xEB6 * 8 + 7)
#define                                 S07C5_bit           _BIT_ACCESS(LCDDATA40,7)
// LCDDATA48<S07C6>
extern volatile __bit                   S07C6               __at(0x75F7);	// @ (0xEBE * 8 + 7)
#define                                 S07C6_bit           _BIT_ACCESS(LCDDATA48,7)
// LCDDATA56<S07C7>
extern volatile __bit                   S07C7               __at(0x7637);	// @ (0xEC6 * 8 + 7)
#define                                 S07C7_bit           _BIT_ACCESS(LCDDATA56,7)
// LCDDATA1<S08C0>
extern volatile __bit                   S08C0               __at(0x7478);	// @ (0xE8F * 8 + 0)
#define                                 S08C0_bit           _BIT_ACCESS(LCDDATA1,0)
// LCDDATA9<S08C1>
extern volatile __bit                   S08C1               __at(0x74B8);	// @ (0xE97 * 8 + 0)
#define                                 S08C1_bit           _BIT_ACCESS(LCDDATA9,0)
// LCDDATA17<S08C2>
extern volatile __bit                   S08C2               __at(0x74F8);	// @ (0xE9F * 8 + 0)
#define                                 S08C2_bit           _BIT_ACCESS(LCDDATA17,0)
// LCDDATA25<S08C3>
extern volatile __bit                   S08C3               __at(0x7538);	// @ (0xEA7 * 8 + 0)
#define                                 S08C3_bit           _BIT_ACCESS(LCDDATA25,0)
// LCDDATA33<S08C4>
extern volatile __bit                   S08C4               __at(0x7578);	// @ (0xEAF * 8 + 0)
#define                                 S08C4_bit           _BIT_ACCESS(LCDDATA33,0)
// LCDDATA41<S08C5>
extern volatile __bit                   S08C5               __at(0x75B8);	// @ (0xEB7 * 8 + 0)
#define                                 S08C5_bit           _BIT_ACCESS(LCDDATA41,0)
// LCDDATA49<S08C6>
extern volatile __bit                   S08C6               __at(0x75F8);	// @ (0xEBF * 8 + 0)
#define                                 S08C6_bit           _BIT_ACCESS(LCDDATA49,0)
// LCDDATA57<S08C7>
extern volatile __bit                   S08C7               __at(0x7638);	// @ (0xEC7 * 8 + 0)
#define                                 S08C7_bit           _BIT_ACCESS(LCDDATA57,0)
// LCDDATA1<S09C0>
extern volatile __bit                   S09C0               __at(0x7479);	// @ (0xE8F * 8 + 1)
#define                                 S09C0_bit           _BIT_ACCESS(LCDDATA1,1)
// LCDDATA9<S09C1>
extern volatile __bit                   S09C1               __at(0x74B9);	// @ (0xE97 * 8 + 1)
#define                                 S09C1_bit           _BIT_ACCESS(LCDDATA9,1)
// LCDDATA17<S09C2>
extern volatile __bit                   S09C2               __at(0x74F9);	// @ (0xE9F * 8 + 1)
#define                                 S09C2_bit           _BIT_ACCESS(LCDDATA17,1)
// LCDDATA25<S09C3>
extern volatile __bit                   S09C3               __at(0x7539);	// @ (0xEA7 * 8 + 1)
#define                                 S09C3_bit           _BIT_ACCESS(LCDDATA25,1)
// LCDDATA33<S09C4>
extern volatile __bit                   S09C4               __at(0x7579);	// @ (0xEAF * 8 + 1)
#define                                 S09C4_bit           _BIT_ACCESS(LCDDATA33,1)
// LCDDATA41<S09C5>
extern volatile __bit                   S09C5               __at(0x75B9);	// @ (0xEB7 * 8 + 1)
#define                                 S09C5_bit           _BIT_ACCESS(LCDDATA41,1)
// LCDDATA49<S09C6>
extern volatile __bit                   S09C6               __at(0x75F9);	// @ (0xEBF * 8 + 1)
#define                                 S09C6_bit           _BIT_ACCESS(LCDDATA49,1)
// LCDDATA57<S09C7>
extern volatile __bit                   S09C7               __at(0x7639);	// @ (0xEC7 * 8 + 1)
#define                                 S09C7_bit           _BIT_ACCESS(LCDDATA57,1)
// LCDDATA1<S10C0>
extern volatile __bit                   S10C0               __at(0x747A);	// @ (0xE8F * 8 + 2)
#define                                 S10C0_bit           _BIT_ACCESS(LCDDATA1,2)
// LCDDATA9<S10C1>
extern volatile __bit                   S10C1               __at(0x74BA);	// @ (0xE97 * 8 + 2)
#define                                 S10C1_bit           _BIT_ACCESS(LCDDATA9,2)
// LCDDATA17<S10C2>
extern volatile __bit                   S10C2               __at(0x74FA);	// @ (0xE9F * 8 + 2)
#define                                 S10C2_bit           _BIT_ACCESS(LCDDATA17,2)
// LCDDATA25<S10C3>
extern volatile __bit                   S10C3               __at(0x753A);	// @ (0xEA7 * 8 + 2)
#define                                 S10C3_bit           _BIT_ACCESS(LCDDATA25,2)
// LCDDATA33<S10C4>
extern volatile __bit                   S10C4               __at(0x757A);	// @ (0xEAF * 8 + 2)
#define                                 S10C4_bit           _BIT_ACCESS(LCDDATA33,2)
// LCDDATA41<S10C5>
extern volatile __bit                   S10C5               __at(0x75BA);	// @ (0xEB7 * 8 + 2)
#define                                 S10C5_bit           _BIT_ACCESS(LCDDATA41,2)
// LCDDATA49<S10C6>
extern volatile __bit                   S10C6               __at(0x75FA);	// @ (0xEBF * 8 + 2)
#define                                 S10C6_bit           _BIT_ACCESS(LCDDATA49,2)
// LCDDATA57<S10C7>
extern volatile __bit                   S10C7               __at(0x763A);	// @ (0xEC7 * 8 + 2)
#define                                 S10C7_bit           _BIT_ACCESS(LCDDATA57,2)
// LCDDATA1<S11C0>
extern volatile __bit                   S11C0               __at(0x747B);	// @ (0xE8F * 8 + 3)
#define                                 S11C0_bit           _BIT_ACCESS(LCDDATA1,3)
// LCDDATA9<S11C1>
extern volatile __bit                   S11C1               __at(0x74BB);	// @ (0xE97 * 8 + 3)
#define                                 S11C1_bit           _BIT_ACCESS(LCDDATA9,3)
// LCDDATA17<S11C2>
extern volatile __bit                   S11C2               __at(0x74FB);	// @ (0xE9F * 8 + 3)
#define                                 S11C2_bit           _BIT_ACCESS(LCDDATA17,3)
// LCDDATA25<S11C3>
extern volatile __bit                   S11C3               __at(0x753B);	// @ (0xEA7 * 8 + 3)
#define                                 S11C3_bit           _BIT_ACCESS(LCDDATA25,3)
// LCDDATA33<S11C4>
extern volatile __bit                   S11C4               __at(0x757B);	// @ (0xEAF * 8 + 3)
#define                                 S11C4_bit           _BIT_ACCESS(LCDDATA33,3)
// LCDDATA41<S11C5>
extern volatile __bit                   S11C5               __at(0x75BB);	// @ (0xEB7 * 8 + 3)
#define                                 S11C5_bit           _BIT_ACCESS(LCDDATA41,3)
// LCDDATA49<S11C6>
extern volatile __bit                   S11C6               __at(0x75FB);	// @ (0xEBF * 8 + 3)
#define                                 S11C6_bit           _BIT_ACCESS(LCDDATA49,3)
// LCDDATA57<S11C7>
extern volatile __bit                   S11C7               __at(0x763B);	// @ (0xEC7 * 8 + 3)
#define                                 S11C7_bit           _BIT_ACCESS(LCDDATA57,3)
// LCDDATA1<S12C0>
extern volatile __bit                   S12C0               __at(0x747C);	// @ (0xE8F * 8 + 4)
#define                                 S12C0_bit           _BIT_ACCESS(LCDDATA1,4)
// LCDDATA9<S12C1>
extern volatile __bit                   S12C1               __at(0x74BC);	// @ (0xE97 * 8 + 4)
#define                                 S12C1_bit           _BIT_ACCESS(LCDDATA9,4)
// LCDDATA17<S12C2>
extern volatile __bit                   S12C2               __at(0x74FC);	// @ (0xE9F * 8 + 4)
#define                                 S12C2_bit           _BIT_ACCESS(LCDDATA17,4)
// LCDDATA25<S12C3>
extern volatile __bit                   S12C3               __at(0x753C);	// @ (0xEA7 * 8 + 4)
#define                                 S12C3_bit           _BIT_ACCESS(LCDDATA25,4)
// LCDDATA33<S12C4>
extern volatile __bit                   S12C4               __at(0x757C);	// @ (0xEAF * 8 + 4)
#define                                 S12C4_bit           _BIT_ACCESS(LCDDATA33,4)
// LCDDATA41<S12C5>
extern volatile __bit                   S12C5               __at(0x75BC);	// @ (0xEB7 * 8 + 4)
#define                                 S12C5_bit           _BIT_ACCESS(LCDDATA41,4)
// LCDDATA49<S12C6>
extern volatile __bit                   S12C6               __at(0x75FC);	// @ (0xEBF * 8 + 4)
#define                                 S12C6_bit           _BIT_ACCESS(LCDDATA49,4)
// LCDDATA57<S12C7>
extern volatile __bit                   S12C7               __at(0x763C);	// @ (0xEC7 * 8 + 4)
#define                                 S12C7_bit           _BIT_ACCESS(LCDDATA57,4)
// LCDDATA1<S13C0>
extern volatile __bit                   S13C0               __at(0x747D);	// @ (0xE8F * 8 + 5)
#define                                 S13C0_bit           _BIT_ACCESS(LCDDATA1,5)
// LCDDATA9<S13C1>
extern volatile __bit                   S13C1               __at(0x74BD);	// @ (0xE97 * 8 + 5)
#define                                 S13C1_bit           _BIT_ACCESS(LCDDATA9,5)
// LCDDATA17<S13C2>
extern volatile __bit                   S13C2               __at(0x74FD);	// @ (0xE9F * 8 + 5)
#define                                 S13C2_bit           _BIT_ACCESS(LCDDATA17,5)
// LCDDATA25<S13C3>
extern volatile __bit                   S13C3               __at(0x753D);	// @ (0xEA7 * 8 + 5)
#define                                 S13C3_bit           _BIT_ACCESS(LCDDATA25,5)
// LCDDATA33<S13C4>
extern volatile __bit                   S13C4               __at(0x757D);	// @ (0xEAF * 8 + 5)
#define                                 S13C4_bit           _BIT_ACCESS(LCDDATA33,5)
// LCDDATA41<S13C5>
extern volatile __bit                   S13C5               __at(0x75BD);	// @ (0xEB7 * 8 + 5)
#define                                 S13C5_bit           _BIT_ACCESS(LCDDATA41,5)
// LCDDATA49<S13C6>
extern volatile __bit                   S13C6               __at(0x75FD);	// @ (0xEBF * 8 + 5)
#define                                 S13C6_bit           _BIT_ACCESS(LCDDATA49,5)
// LCDDATA57<S13C7>
extern volatile __bit                   S13C7               __at(0x763D);	// @ (0xEC7 * 8 + 5)
#define                                 S13C7_bit           _BIT_ACCESS(LCDDATA57,5)
// LCDDATA1<S14C0>
extern volatile __bit                   S14C0               __at(0x747E);	// @ (0xE8F * 8 + 6)
#define                                 S14C0_bit           _BIT_ACCESS(LCDDATA1,6)
// LCDDATA9<S14C1>
extern volatile __bit                   S14C1               __at(0x74BE);	// @ (0xE97 * 8 + 6)
#define                                 S14C1_bit           _BIT_ACCESS(LCDDATA9,6)
// LCDDATA17<S14C2>
extern volatile __bit                   S14C2               __at(0x74FE);	// @ (0xE9F * 8 + 6)
#define                                 S14C2_bit           _BIT_ACCESS(LCDDATA17,6)
// LCDDATA25<S14C3>
extern volatile __bit                   S14C3               __at(0x753E);	// @ (0xEA7 * 8 + 6)
#define                                 S14C3_bit           _BIT_ACCESS(LCDDATA25,6)
// LCDDATA33<S14C4>
