MikroElektronika/core_packages/PIC/XC8/def/PIC18F85J94/mcu.h
extern volatile __bit                   S59C3               __at(0x756B);	// @ (0xEAD * 8 + 3)
#define                                 S59C3_bit           _BIT_ACCESS(LCDDATA31,3)
// LCDDATA39<S59C4>
extern volatile __bit                   S59C4               __at(0x75AB);	// @ (0xEB5 * 8 + 3)
#define                                 S59C4_bit           _BIT_ACCESS(LCDDATA39,3)
// LCDDATA47<S59C5>
extern volatile __bit                   S59C5               __at(0x75EB);	// @ (0xEBD * 8 + 3)
#define                                 S59C5_bit           _BIT_ACCESS(LCDDATA47,3)
// LCDDATA55<S59C6>
extern volatile __bit                   S59C6               __at(0x762B);	// @ (0xEC5 * 8 + 3)
#define                                 S59C6_bit           _BIT_ACCESS(LCDDATA55,3)
// LCDDATA63<S59C7>
extern volatile __bit                   S59C7               __at(0x766B);	// @ (0xECD * 8 + 3)
#define                                 S59C7_bit           _BIT_ACCESS(LCDDATA63,3)
// LCDDATA7<S60C0>
extern volatile __bit                   S60C0               __at(0x74AC);	// @ (0xE95 * 8 + 4)
#define                                 S60C0_bit           _BIT_ACCESS(LCDDATA7,4)
// LCDDATA15<S60C1>
extern volatile __bit                   S60C1               __at(0x74EC);	// @ (0xE9D * 8 + 4)
#define                                 S60C1_bit           _BIT_ACCESS(LCDDATA15,4)
// LCDDATA23<S60C2>
extern volatile __bit                   S60C2               __at(0x752C);	// @ (0xEA5 * 8 + 4)
#define                                 S60C2_bit           _BIT_ACCESS(LCDDATA23,4)
// LCDDATA31<S60C3>
extern volatile __bit                   S60C3               __at(0x756C);	// @ (0xEAD * 8 + 4)
#define                                 S60C3_bit           _BIT_ACCESS(LCDDATA31,4)
// LCDDATA39<S60C4>
extern volatile __bit                   S60C4               __at(0x75AC);	// @ (0xEB5 * 8 + 4)
#define                                 S60C4_bit           _BIT_ACCESS(LCDDATA39,4)
// LCDDATA47<S60C5>
extern volatile __bit                   S60C5               __at(0x75EC);	// @ (0xEBD * 8 + 4)
#define                                 S60C5_bit           _BIT_ACCESS(LCDDATA47,4)
// LCDDATA55<S60C6>
extern volatile __bit                   S60C6               __at(0x762C);	// @ (0xEC5 * 8 + 4)
#define                                 S60C6_bit           _BIT_ACCESS(LCDDATA55,4)
// LCDDATA63<S60C7>
extern volatile __bit                   S60C7               __at(0x766C);	// @ (0xECD * 8 + 4)
#define                                 S60C7_bit           _BIT_ACCESS(LCDDATA63,4)
// LCDDATA7<S61C0>
extern volatile __bit                   S61C0               __at(0x74AD);	// @ (0xE95 * 8 + 5)
#define                                 S61C0_bit           _BIT_ACCESS(LCDDATA7,5)
// LCDDATA15<S61C1>
extern volatile __bit                   S61C1               __at(0x74ED);	// @ (0xE9D * 8 + 5)
#define                                 S61C1_bit           _BIT_ACCESS(LCDDATA15,5)
// LCDDATA23<S61C2>
extern volatile __bit                   S61C2               __at(0x752D);	// @ (0xEA5 * 8 + 5)
#define                                 S61C2_bit           _BIT_ACCESS(LCDDATA23,5)
// LCDDATA31<S61C3>
extern volatile __bit                   S61C3               __at(0x756D);	// @ (0xEAD * 8 + 5)
#define                                 S61C3_bit           _BIT_ACCESS(LCDDATA31,5)
// LCDDATA39<S61C4>
extern volatile __bit                   S61C4               __at(0x75AD);	// @ (0xEB5 * 8 + 5)
#define                                 S61C4_bit           _BIT_ACCESS(LCDDATA39,5)
// LCDDATA47<S61C5>
extern volatile __bit                   S61C5               __at(0x75ED);	// @ (0xEBD * 8 + 5)
#define                                 S61C5_bit           _BIT_ACCESS(LCDDATA47,5)
// LCDDATA55<S61C6>
extern volatile __bit                   S61C6               __at(0x762D);	// @ (0xEC5 * 8 + 5)
#define                                 S61C6_bit           _BIT_ACCESS(LCDDATA55,5)
// LCDDATA63<S61C7>
extern volatile __bit                   S61C7               __at(0x766D);	// @ (0xECD * 8 + 5)
#define                                 S61C7_bit           _BIT_ACCESS(LCDDATA63,5)
// LCDDATA7<S62C0>
extern volatile __bit                   S62C0               __at(0x74AE);	// @ (0xE95 * 8 + 6)
#define                                 S62C0_bit           _BIT_ACCESS(LCDDATA7,6)
// LCDDATA15<S62C1>
extern volatile __bit                   S62C1               __at(0x74EE);	// @ (0xE9D * 8 + 6)
#define                                 S62C1_bit           _BIT_ACCESS(LCDDATA15,6)
// LCDDATA23<S62C2>
extern volatile __bit                   S62C2               __at(0x752E);	// @ (0xEA5 * 8 + 6)
#define                                 S62C2_bit           _BIT_ACCESS(LCDDATA23,6)
// LCDDATA31<S62C3>
extern volatile __bit                   S62C3               __at(0x756E);	// @ (0xEAD * 8 + 6)
#define                                 S62C3_bit           _BIT_ACCESS(LCDDATA31,6)
// LCDDATA39<S62C4>
extern volatile __bit                   S62C4               __at(0x75AE);	// @ (0xEB5 * 8 + 6)
#define                                 S62C4_bit           _BIT_ACCESS(LCDDATA39,6)
// LCDDATA47<S62C5>
extern volatile __bit                   S62C5               __at(0x75EE);	// @ (0xEBD * 8 + 6)
#define                                 S62C5_bit           _BIT_ACCESS(LCDDATA47,6)
// LCDDATA55<S62C6>
extern volatile __bit                   S62C6               __at(0x762E);	// @ (0xEC5 * 8 + 6)
#define                                 S62C6_bit           _BIT_ACCESS(LCDDATA55,6)
// LCDDATA63<S62C7>
extern volatile __bit                   S62C7               __at(0x766E);	// @ (0xECD * 8 + 6)
#define                                 S62C7_bit           _BIT_ACCESS(LCDDATA63,6)
// LCDDATA7<S63C0>
extern volatile __bit                   S63C0               __at(0x74AF);	// @ (0xE95 * 8 + 7)
#define                                 S63C0_bit           _BIT_ACCESS(LCDDATA7,7)
// LCDDATA15<S63C1>
extern volatile __bit                   S63C1               __at(0x74EF);	// @ (0xE9D * 8 + 7)
#define                                 S63C1_bit           _BIT_ACCESS(LCDDATA15,7)
// LCDDATA23<S63C2>
extern volatile __bit                   S63C2               __at(0x752F);	// @ (0xEA5 * 8 + 7)
#define                                 S63C2_bit           _BIT_ACCESS(LCDDATA23,7)
// LCDDATA31<S63C3>
extern volatile __bit                   S63C3               __at(0x756F);	// @ (0xEAD * 8 + 7)
#define                                 S63C3_bit           _BIT_ACCESS(LCDDATA31,7)
// LCDDATA39<S63C4>
extern volatile __bit                   S63C4               __at(0x75AF);	// @ (0xEB5 * 8 + 7)
#define                                 S63C4_bit           _BIT_ACCESS(LCDDATA39,7)
// LCDDATA47<S63C5>
extern volatile __bit                   S63C5               __at(0x75EF);	// @ (0xEBD * 8 + 7)
#define                                 S63C5_bit           _BIT_ACCESS(LCDDATA47,7)
// LCDDATA55<S63C6>
extern volatile __bit                   S63C6               __at(0x762F);	// @ (0xEC5 * 8 + 7)
#define                                 S63C6_bit           _BIT_ACCESS(LCDDATA55,7)
// LCDDATA63<S63C7>
extern volatile __bit                   S63C7               __at(0x766F);	// @ (0xECD * 8 + 7)
#define                                 S63C7_bit           _BIT_ACCESS(LCDDATA63,7)
// ADCON3H<SAMC0>
extern volatile __bit                   SAMC0               __at(0x7458);	// @ (0xE8B * 8 + 0)
#define                                 SAMC0_bit           _BIT_ACCESS(ADCON3H,0)
// ADCON3H<SAMC1>
extern volatile __bit                   SAMC1               __at(0x7459);	// @ (0xE8B * 8 + 1)
#define                                 SAMC1_bit           _BIT_ACCESS(ADCON3H,1)
// ADCON3H<SAMC2>
extern volatile __bit                   SAMC2               __at(0x745A);	// @ (0xE8B * 8 + 2)
#define                                 SAMC2_bit           _BIT_ACCESS(ADCON3H,2)
// ADCON3H<SAMC3>
extern volatile __bit                   SAMC3               __at(0x745B);	// @ (0xE8B * 8 + 3)
#define                                 SAMC3_bit           _BIT_ACCESS(ADCON3H,3)
// ADCON3H<SAMC4>
extern volatile __bit                   SAMC4               __at(0x745C);	// @ (0xE8B * 8 + 4)
#define                                 SAMC4_bit           _BIT_ACCESS(ADCON3H,4)
// ADCON1L<SAMP>
extern volatile __bit                   SAMP                __at(0x7E01);	// @ (0xFC0 * 8 + 1)
#define                                 SAMP_bit            _BIT_ACCESS(ADCON1L,1)
// RPINR8_9<SCK1R0>
extern volatile __bit                   SCK1R0              __at(0x7170);	// @ (0xE2E * 8 + 0)
#define                                 SCK1R0_bit          _BIT_ACCESS(RPINR8_9,0)
// RPINR8_9<SCK1R1>
extern volatile __bit                   SCK1R1              __at(0x7171);	// @ (0xE2E * 8 + 1)
#define                                 SCK1R1_bit          _BIT_ACCESS(RPINR8_9,1)
// RPINR8_9<SCK1R2>
extern volatile __bit                   SCK1R2              __at(0x7172);	// @ (0xE2E * 8 + 2)
#define                                 SCK1R2_bit          _BIT_ACCESS(RPINR8_9,2)
// RPINR8_9<SCK1R3>
extern volatile __bit                   SCK1R3              __at(0x7173);	// @ (0xE2E * 8 + 3)
#define                                 SCK1R3_bit          _BIT_ACCESS(RPINR8_9,3)
// RPINR10_11<SCK2R0>
extern volatile __bit                   SCK2R0              __at(0x717C);	// @ (0xE2F * 8 + 4)
#define                                 SCK2R0_bit          _BIT_ACCESS(RPINR10_11,4)
// RPINR10_11<SCK2R1>
extern volatile __bit                   SCK2R1              __at(0x717D);	// @ (0xE2F * 8 + 5)
#define                                 SCK2R1_bit          _BIT_ACCESS(RPINR10_11,5)
// RPINR10_11<SCK2R2>
extern volatile __bit                   SCK2R2              __at(0x717E);	// @ (0xE2F * 8 + 6)
#define                                 SCK2R2_bit          _BIT_ACCESS(RPINR10_11,6)
// RPINR10_11<SCK2R3>
extern volatile __bit                   SCK2R3              __at(0x717F);	// @ (0xE2F * 8 + 7)
#define                                 SCK2R3_bit          _BIT_ACCESS(RPINR10_11,7)
// BAUDCON1<SCKP>
extern volatile __bit                   SCKP                __at(0x7B3C);	// @ (0xF67 * 8 + 4)
#define                                 SCKP_bit            _BIT_ACCESS(BAUDCON1,4)
// BAUDCON1<SCKP1>
extern volatile __bit                   SCKP1               __at(0x7B3C);	// @ (0xF67 * 8 + 4)
#define                                 SCKP1_bit           _BIT_ACCESS(BAUDCON1,4)
// BAUDCON2<SCKP2>
extern volatile __bit                   SCKP2               __at(0x798C);	// @ (0xF31 * 8 + 4)
#define                                 SCKP2_bit           _BIT_ACCESS(BAUDCON2,4)
// BAUDCON3<SCKP3>
extern volatile __bit                   SCKP3               __at(0x796C);	// @ (0xF2D * 8 + 4)
#define                                 SCKP3_bit           _BIT_ACCESS(BAUDCON3,4)
// BAUDCON4<SCKP4>
extern volatile __bit                   SCKP4               __at(0x77EC);	// @ (0xEFD * 8 + 4)
#define                                 SCKP4_bit           _BIT_ACCESS(BAUDCON4,4)
// OSCCON<SCS>
extern volatile __bit                   SCS                 __at(0x7E98);	// @ (0xFD3 * 8 + 0)
#define                                 SCS_bit             _BIT_ACCESS(OSCCON,0)
// RPINR8_9<SDI1R0>
extern volatile __bit                   SDI1R0              __at(0x7174);	// @ (0xE2E * 8 + 4)
#define                                 SDI1R0_bit          _BIT_ACCESS(RPINR8_9,4)
// RPINR8_9<SDI1R1>
extern volatile __bit                   SDI1R1              __at(0x7175);	// @ (0xE2E * 8 + 5)
#define                                 SDI1R1_bit          _BIT_ACCESS(RPINR8_9,5)
// RPINR8_9<SDI1R2>
extern volatile __bit                   SDI1R2              __at(0x7176);	// @ (0xE2E * 8 + 6)
#define                                 SDI1R2_bit          _BIT_ACCESS(RPINR8_9,6)
// RPINR8_9<SDI1R3>
extern volatile __bit                   SDI1R3              __at(0x7177);	// @ (0xE2E * 8 + 7)
#define                                 SDI1R3_bit          _BIT_ACCESS(RPINR8_9,7)
// RPINR12_13<SDI2R0>
extern volatile __bit                   SDI2R0              __at(0x7180);	// @ (0xE30 * 8 + 0)
#define                                 SDI2R0_bit          _BIT_ACCESS(RPINR12_13,0)
// RPINR12_13<SDI2R1>
extern volatile __bit                   SDI2R1              __at(0x7181);	// @ (0xE30 * 8 + 1)
#define                                 SDI2R1_bit          _BIT_ACCESS(RPINR12_13,1)
// RPINR12_13<SDI2R2>
extern volatile __bit                   SDI2R2              __at(0x7182);	// @ (0xE30 * 8 + 2)
#define                                 SDI2R2_bit          _BIT_ACCESS(RPINR12_13,2)
// RPINR12_13<SDI2R3>
extern volatile __bit                   SDI2R3              __at(0x7183);	// @ (0xE30 * 8 + 3)
#define                                 SDI2R3_bit          _BIT_ACCESS(RPINR12_13,3)
// UCON<SE0>
extern volatile __bit                   SE0                 __at(0x7BAD);	// @ (0xF75 * 8 + 5)
#define                                 SE0_bit             _BIT_ACCESS(UCON,5)
// LCDSE0<SE00>
extern volatile __bit                   SE00                __at(0x7670);	// @ (0xECE * 8 + 0)
#define                                 SE00_bit            _BIT_ACCESS(LCDSE0,0)
// LCDSE0<SE01>
extern volatile __bit                   SE01                __at(0x7671);	// @ (0xECE * 8 + 1)
#define                                 SE01_bit            _BIT_ACCESS(LCDSE0,1)
// LCDSE0<SE02>
extern volatile __bit                   SE02                __at(0x7672);	// @ (0xECE * 8 + 2)
#define                                 SE02_bit            _BIT_ACCESS(LCDSE0,2)
// LCDSE0<SE03>
extern volatile __bit                   SE03                __at(0x7673);	// @ (0xECE * 8 + 3)
#define                                 SE03_bit            _BIT_ACCESS(LCDSE0,3)
// LCDSE0<SE04>
extern volatile __bit                   SE04                __at(0x7674);	// @ (0xECE * 8 + 4)
#define                                 SE04_bit            _BIT_ACCESS(LCDSE0,4)
// LCDSE0<SE05>
extern volatile __bit                   SE05                __at(0x7675);	// @ (0xECE * 8 + 5)
#define                                 SE05_bit            _BIT_ACCESS(LCDSE0,5)
// LCDSE0<SE06>
extern volatile __bit                   SE06                __at(0x7676);	// @ (0xECE * 8 + 6)
#define                                 SE06_bit            _BIT_ACCESS(LCDSE0,6)
// LCDSE0<SE07>
extern volatile __bit                   SE07                __at(0x7677);	// @ (0xECE * 8 + 7)
#define                                 SE07_bit            _BIT_ACCESS(LCDSE0,7)
// LCDSE1<SE08>
extern volatile __bit                   SE08                __at(0x7678);	// @ (0xECF * 8 + 0)
#define                                 SE08_bit            _BIT_ACCESS(LCDSE1,0)
// LCDSE1<SE09>
extern volatile __bit                   SE09                __at(0x7679);	// @ (0xECF * 8 + 1)
#define                                 SE09_bit            _BIT_ACCESS(LCDSE1,1)
// LCDSE1<SE10>
extern volatile __bit                   SE10                __at(0x767A);	// @ (0xECF * 8 + 2)
#define                                 SE10_bit            _BIT_ACCESS(LCDSE1,2)
// LCDSE1<SE11>
extern volatile __bit                   SE11                __at(0x767B);	// @ (0xECF * 8 + 3)
#define                                 SE11_bit            _BIT_ACCESS(LCDSE1,3)
// LCDSE1<SE12>
extern volatile __bit                   SE12                __at(0x767C);	// @ (0xECF * 8 + 4)
#define                                 SE12_bit            _BIT_ACCESS(LCDSE1,4)
// LCDSE1<SE13>
extern volatile __bit                   SE13                __at(0x767D);	// @ (0xECF * 8 + 5)
#define                                 SE13_bit            _BIT_ACCESS(LCDSE1,5)
// LCDSE1<SE14>
extern volatile __bit                   SE14                __at(0x767E);	// @ (0xECF * 8 + 6)
#define                                 SE14_bit            _BIT_ACCESS(LCDSE1,6)
// LCDSE1<SE15>
extern volatile __bit                   SE15                __at(0x767F);	// @ (0xECF * 8 + 7)
#define                                 SE15_bit            _BIT_ACCESS(LCDSE1,7)
// LCDSE2<SE16>
extern volatile __bit                   SE16                __at(0x7680);	// @ (0xED0 * 8 + 0)
#define                                 SE16_bit            _BIT_ACCESS(LCDSE2,0)
// LCDSE2<SE17>
extern volatile __bit                   SE17                __at(0x7681);	// @ (0xED0 * 8 + 1)
#define                                 SE17_bit            _BIT_ACCESS(LCDSE2,1)
// LCDSE2<SE18>
extern volatile __bit                   SE18                __at(0x7682);	// @ (0xED0 * 8 + 2)
#define                                 SE18_bit            _BIT_ACCESS(LCDSE2,2)
// LCDSE2<SE19>
extern volatile __bit                   SE19                __at(0x7683);	// @ (0xED0 * 8 + 3)
#define                                 SE19_bit            _BIT_ACCESS(LCDSE2,3)
// LCDSE2<SE20>
extern volatile __bit                   SE20                __at(0x7684);	// @ (0xED0 * 8 + 4)
#define                                 SE20_bit            _BIT_ACCESS(LCDSE2,4)
// LCDSE2<SE21>
extern volatile __bit                   SE21                __at(0x7685);	// @ (0xED0 * 8 + 5)
#define                                 SE21_bit            _BIT_ACCESS(LCDSE2,5)
// LCDSE2<SE22>
extern volatile __bit                   SE22                __at(0x7686);	// @ (0xED0 * 8 + 6)
#define                                 SE22_bit            _BIT_ACCESS(LCDSE2,6)
// LCDSE2<SE23>
extern volatile __bit                   SE23                __at(0x7687);	// @ (0xED0 * 8 + 7)
#define                                 SE23_bit            _BIT_ACCESS(LCDSE2,7)
// LCDSE3<SE24>
extern volatile __bit                   SE24                __at(0x7688);	// @ (0xED1 * 8 + 0)
#define                                 SE24_bit            _BIT_ACCESS(LCDSE3,0)
// LCDSE3<SE25>
extern volatile __bit                   SE25                __at(0x7689);	// @ (0xED1 * 8 + 1)
#define                                 SE25_bit            _BIT_ACCESS(LCDSE3,1)
// LCDSE3<SE26>
extern volatile __bit                   SE26                __at(0x768A);	// @ (0xED1 * 8 + 2)
#define                                 SE26_bit            _BIT_ACCESS(LCDSE3,2)
// LCDSE3<SE27>
extern volatile __bit                   SE27                __at(0x768B);	// @ (0xED1 * 8 + 3)
#define                                 SE27_bit            _BIT_ACCESS(LCDSE3,3)
// LCDSE3<SE28>
extern volatile __bit                   SE28                __at(0x768C);	// @ (0xED1 * 8 + 4)
#define                                 SE28_bit            _BIT_ACCESS(LCDSE3,4)
// LCDSE3<SE29>
extern volatile __bit                   SE29                __at(0x768D);	// @ (0xED1 * 8 + 5)
#define                                 SE29_bit            _BIT_ACCESS(LCDSE3,5)
// LCDSE3<SE30>
extern volatile __bit                   SE30                __at(0x768E);	// @ (0xED1 * 8 + 6)
#define                                 SE30_bit            _BIT_ACCESS(LCDSE3,6)
// LCDSE3<SE31>
extern volatile __bit                   SE31                __at(0x768F);	// @ (0xED1 * 8 + 7)
#define                                 SE31_bit            _BIT_ACCESS(LCDSE3,7)
// LCDSE4<SE32>
extern volatile __bit                   SE32                __at(0x7690);	// @ (0xED2 * 8 + 0)
#define                                 SE32_bit            _BIT_ACCESS(LCDSE4,0)
// LCDSE4<SE33>
extern volatile __bit                   SE33                __at(0x7691);	// @ (0xED2 * 8 + 1)
#define                                 SE33_bit            _BIT_ACCESS(LCDSE4,1)
// LCDSE4<SE34>
extern volatile __bit                   SE34                __at(0x7692);	// @ (0xED2 * 8 + 2)
#define                                 SE34_bit            _BIT_ACCESS(LCDSE4,2)
// LCDSE4<SE35>
extern volatile __bit                   SE35                __at(0x7693);	// @ (0xED2 * 8 + 3)
#define                                 SE35_bit            _BIT_ACCESS(LCDSE4,3)
// LCDSE4<SE36>
extern volatile __bit                   SE36                __at(0x7694);	// @ (0xED2 * 8 + 4)
#define                                 SE36_bit            _BIT_ACCESS(LCDSE4,4)
// LCDSE4<SE37>
extern volatile __bit                   SE37                __at(0x7695);	// @ (0xED2 * 8 + 5)
#define                                 SE37_bit            _BIT_ACCESS(LCDSE4,5)
// LCDSE4<SE38>
extern volatile __bit                   SE38                __at(0x7696);	// @ (0xED2 * 8 + 6)
#define                                 SE38_bit            _BIT_ACCESS(LCDSE4,6)
// LCDSE4<SE39>
extern volatile __bit                   SE39                __at(0x7697);	// @ (0xED2 * 8 + 7)
#define                                 SE39_bit            _BIT_ACCESS(LCDSE4,7)
// LCDSE5<SE40>
extern volatile __bit                   SE40                __at(0x7698);	// @ (0xED3 * 8 + 0)
#define                                 SE40_bit            _BIT_ACCESS(LCDSE5,0)
// LCDSE5<SE41>
extern volatile __bit                   SE41                __at(0x7699);	// @ (0xED3 * 8 + 1)
#define                                 SE41_bit            _BIT_ACCESS(LCDSE5,1)
// LCDSE5<SE42>
extern volatile __bit                   SE42                __at(0x769A);	// @ (0xED3 * 8 + 2)
#define                                 SE42_bit            _BIT_ACCESS(LCDSE5,2)
// LCDSE5<SE43>
extern volatile __bit                   SE43                __at(0x769B);	// @ (0xED3 * 8 + 3)
#define                                 SE43_bit            _BIT_ACCESS(LCDSE5,3)
// LCDSE5<SE44>
extern volatile __bit                   SE44                __at(0x769C);	// @ (0xED3 * 8 + 4)
#define                                 SE44_bit            _BIT_ACCESS(LCDSE5,4)
// LCDSE5<SE45>
extern volatile __bit                   SE45                __at(0x769D);	// @ (0xED3 * 8 + 5)
#define                                 SE45_bit            _BIT_ACCESS(LCDSE5,5)
// LCDSE5<SE46>
extern volatile __bit                   SE46                __at(0x769E);	// @ (0xED3 * 8 + 6)
#define                                 SE46_bit            _BIT_ACCESS(LCDSE5,6)
// LCDSE5<SE47>
extern volatile __bit                   SE47                __at(0x769F);	// @ (0xED3 * 8 + 7)
#define                                 SE47_bit            _BIT_ACCESS(LCDSE5,7)
// LCDSE6<SE48>
extern volatile __bit                   SE48                __at(0x76A0);	// @ (0xED4 * 8 + 0)
#define                                 SE48_bit            _BIT_ACCESS(LCDSE6,0)
// LCDSE6<SE49>
extern volatile __bit                   SE49                __at(0x76A1);	// @ (0xED4 * 8 + 1)
#define                                 SE49_bit            _BIT_ACCESS(LCDSE6,1)
// LCDSE6<SE50>
extern volatile __bit                   SE50                __at(0x76A2);	// @ (0xED4 * 8 + 2)
#define                                 SE50_bit            _BIT_ACCESS(LCDSE6,2)
// LCDSE6<SE51>
extern volatile __bit                   SE51                __at(0x76A3);	// @ (0xED4 * 8 + 3)
#define                                 SE51_bit            _BIT_ACCESS(LCDSE6,3)
// LCDSE6<SE52>
extern volatile __bit                   SE52                __at(0x76A4);	// @ (0xED4 * 8 + 4)
#define                                 SE52_bit            _BIT_ACCESS(LCDSE6,4)
// LCDSE6<SE53>
extern volatile __bit                   SE53                __at(0x76A5);	// @ (0xED4 * 8 + 5)
#define                                 SE53_bit            _BIT_ACCESS(LCDSE6,5)
// LCDSE6<SE54>
extern volatile __bit                   SE54                __at(0x76A6);	// @ (0xED4 * 8 + 6)
#define                                 SE54_bit            _BIT_ACCESS(LCDSE6,6)
// LCDSE6<SE55>
extern volatile __bit                   SE55                __at(0x76A7);	// @ (0xED4 * 8 + 7)
#define                                 SE55_bit            _BIT_ACCESS(LCDSE6,7)
// LCDSE7<SE56>
