MikroElektronika/core_packages/PIC/XC8/def/PIC18F85J94/mcu.h
#define                                 TX4IP_bit           _BIT_ACCESS(IPR6,6)
// TXSTA1<TX8_9>
extern volatile __bit                   TX8_9               __at(0x7D66);	// @ (0xFAC * 8 + 6)
#define                                 TX8_9_bit           _BIT_ACCESS(TXSTA1,6)
// TXSTA2<TX8_92>
extern volatile __bit                   TX8_92              __at(0x7996);	// @ (0xF32 * 8 + 6)
#define                                 TX8_92_bit          _BIT_ACCESS(TXSTA2,6)
// TXSTA3<TX8_93>
extern volatile __bit                   TX8_93              __at(0x7976);	// @ (0xF2E * 8 + 6)
#define                                 TX8_93_bit          _BIT_ACCESS(TXSTA3,6)
// TXSTA4<TX8_94>
extern volatile __bit                   TX8_94              __at(0x77F6);	// @ (0xEFE * 8 + 6)
#define                                 TX8_94_bit          _BIT_ACCESS(TXSTA4,6)
// TXSTA1<TX91>
extern volatile __bit                   TX91                __at(0x7D66);	// @ (0xFAC * 8 + 6)
#define                                 TX91_bit            _BIT_ACCESS(TXSTA1,6)
// TXSTA1<TX9D1>
extern volatile __bit                   TX9D1               __at(0x7D60);	// @ (0xFAC * 8 + 0)
#define                                 TX9D1_bit           _BIT_ACCESS(TXSTA1,0)
// TXADDRL<TXADDR0>
extern volatile __bit                   TXADDR0             __at(0x7B80);	// @ (0xF70 * 8 + 0)
#define                                 TXADDR0_bit         _BIT_ACCESS(TXADDRL,0)
// TXADDRL<TXADDR1>
extern volatile __bit                   TXADDR1             __at(0x7B81);	// @ (0xF70 * 8 + 1)
#define                                 TXADDR1_bit         _BIT_ACCESS(TXADDRL,1)
// TXADDRH<TXADDR10>
extern volatile __bit                   TXADDR10            __at(0x7B7A);	// @ (0xF6F * 8 + 2)
#define                                 TXADDR10_bit        _BIT_ACCESS(TXADDRH,2)
// TXADDRH<TXADDR11>
extern volatile __bit                   TXADDR11            __at(0x7B7B);	// @ (0xF6F * 8 + 3)
#define                                 TXADDR11_bit        _BIT_ACCESS(TXADDRH,3)
// TXADDRL<TXADDR2>
extern volatile __bit                   TXADDR2             __at(0x7B82);	// @ (0xF70 * 8 + 2)
#define                                 TXADDR2_bit         _BIT_ACCESS(TXADDRL,2)
// TXADDRL<TXADDR3>
extern volatile __bit                   TXADDR3             __at(0x7B83);	// @ (0xF70 * 8 + 3)
#define                                 TXADDR3_bit         _BIT_ACCESS(TXADDRL,3)
// TXADDRL<TXADDR4>
extern volatile __bit                   TXADDR4             __at(0x7B84);	// @ (0xF70 * 8 + 4)
#define                                 TXADDR4_bit         _BIT_ACCESS(TXADDRL,4)
// TXADDRL<TXADDR5>
extern volatile __bit                   TXADDR5             __at(0x7B85);	// @ (0xF70 * 8 + 5)
#define                                 TXADDR5_bit         _BIT_ACCESS(TXADDRL,5)
// TXADDRL<TXADDR6>
extern volatile __bit                   TXADDR6             __at(0x7B86);	// @ (0xF70 * 8 + 6)
#define                                 TXADDR6_bit         _BIT_ACCESS(TXADDRL,6)
// TXADDRL<TXADDR7>
extern volatile __bit                   TXADDR7             __at(0x7B87);	// @ (0xF70 * 8 + 7)
#define                                 TXADDR7_bit         _BIT_ACCESS(TXADDRL,7)
// TXADDRH<TXADDR8>
extern volatile __bit                   TXADDR8             __at(0x7B78);	// @ (0xF6F * 8 + 0)
#define                                 TXADDR8_bit         _BIT_ACCESS(TXADDRH,0)
// TXADDRH<TXADDR9>
extern volatile __bit                   TXADDR9             __at(0x7B79);	// @ (0xF6F * 8 + 1)
#define                                 TXADDR9_bit         _BIT_ACCESS(TXADDRH,1)
// PIE3<TXB0IE>
extern volatile __bit                   TXB0IE              __at(0x7D1A);	// @ (0xFA3 * 8 + 2)
#define                                 TXB0IE_bit          _BIT_ACCESS(PIE3,2)
// PIE3<TXB1IE>
extern volatile __bit                   TXB1IE              __at(0x7D1B);	// @ (0xFA3 * 8 + 3)
#define                                 TXB1IE_bit          _BIT_ACCESS(PIE3,3)
// PIE3<TXB2IE>
extern volatile __bit                   TXB2IE              __at(0x7D1C);	// @ (0xFA3 * 8 + 4)
#define                                 TXB2IE_bit          _BIT_ACCESS(PIE3,4)
// PIE3<TXBNIE>
extern volatile __bit                   TXBNIE              __at(0x7D1C);	// @ (0xFA3 * 8 + 4)
#define                                 TXBNIE_bit          _BIT_ACCESS(PIE3,4)
// PIR3<TXBNIF>
extern volatile __bit                   TXBNIF              __at(0x7D24);	// @ (0xFA4 * 8 + 4)
#define                                 TXBNIF_bit          _BIT_ACCESS(PIR3,4)
// IPR3<TXBNIP>
extern volatile __bit                   TXBNIP              __at(0x7D2C);	// @ (0xFA5 * 8 + 4)
#define                                 TXBNIP_bit          _BIT_ACCESS(IPR3,4)
// TXBUF<TXBUF0>
extern volatile __bit                   TXBUF0              __at(0x7B50);	// @ (0xF6A * 8 + 0)
#define                                 TXBUF0_bit          _BIT_ACCESS(TXBUF,0)
// TXBUF<TXBUF1>
extern volatile __bit                   TXBUF1              __at(0x7B51);	// @ (0xF6A * 8 + 1)
#define                                 TXBUF1_bit          _BIT_ACCESS(TXBUF,1)
// TXBUF<TXBUF2>
extern volatile __bit                   TXBUF2              __at(0x7B52);	// @ (0xF6A * 8 + 2)
#define                                 TXBUF2_bit          _BIT_ACCESS(TXBUF,2)
// TXBUF<TXBUF3>
extern volatile __bit                   TXBUF3              __at(0x7B53);	// @ (0xF6A * 8 + 3)
#define                                 TXBUF3_bit          _BIT_ACCESS(TXBUF,3)
// TXBUF<TXBUF4>
extern volatile __bit                   TXBUF4              __at(0x7B54);	// @ (0xF6A * 8 + 4)
#define                                 TXBUF4_bit          _BIT_ACCESS(TXBUF,4)
// TXBUF<TXBUF5>
extern volatile __bit                   TXBUF5              __at(0x7B55);	// @ (0xF6A * 8 + 5)
#define                                 TXBUF5_bit          _BIT_ACCESS(TXBUF,5)
// TXBUF<TXBUF6>
extern volatile __bit                   TXBUF6              __at(0x7B56);	// @ (0xF6A * 8 + 6)
#define                                 TXBUF6_bit          _BIT_ACCESS(TXBUF,6)
// TXBUF<TXBUF7>
extern volatile __bit                   TXBUF7              __at(0x7B57);	// @ (0xF6A * 8 + 7)
#define                                 TXBUF7_bit          _BIT_ACCESS(TXBUF,7)
// BAUDCON1<TXCKP1>
extern volatile __bit                   TXCKP1              __at(0x7B3C);	// @ (0xF67 * 8 + 4)
#define                                 TXCKP1_bit          _BIT_ACCESS(BAUDCON1,4)
// BAUDCON2<TXCKP2>
extern volatile __bit                   TXCKP2              __at(0x798C);	// @ (0xF31 * 8 + 4)
#define                                 TXCKP2_bit          _BIT_ACCESS(BAUDCON2,4)
// BAUDCON3<TXCKP3>
extern volatile __bit                   TXCKP3              __at(0x796C);	// @ (0xF2D * 8 + 4)
#define                                 TXCKP3_bit          _BIT_ACCESS(BAUDCON3,4)
// BAUDCON4<TXCKP4>
extern volatile __bit                   TXCKP4              __at(0x77EC);	// @ (0xEFD * 8 + 4)
#define                                 TXCKP4_bit          _BIT_ACCESS(BAUDCON4,4)
// TXSTA1<TXD8>
extern volatile __bit                   TXD8                __at(0x7D60);	// @ (0xFAC * 8 + 0)
#define                                 TXD8_bit            _BIT_ACCESS(TXSTA1,0)
// TXSTA2<TXD82>
extern volatile __bit                   TXD82               __at(0x7990);	// @ (0xF32 * 8 + 0)
#define                                 TXD82_bit           _BIT_ACCESS(TXSTA2,0)
// TXSTA3<TXD83>
extern volatile __bit                   TXD83               __at(0x7970);	// @ (0xF2E * 8 + 0)
#define                                 TXD83_bit           _BIT_ACCESS(TXSTA3,0)
// TXSTA4<TXD84>
extern volatile __bit                   TXD84               __at(0x77F0);	// @ (0xEFE * 8 + 0)
#define                                 TXD84_bit           _BIT_ACCESS(TXSTA4,0)
// TXSTA1<TXEN1>
extern volatile __bit                   TXEN1               __at(0x7D65);	// @ (0xFAC * 8 + 5)
#define                                 TXEN1_bit           _BIT_ACCESS(TXSTA1,5)
// PIE1<TXIE>
extern volatile __bit                   TXIE                __at(0x7CEC);	// @ (0xF9D * 8 + 4)
#define                                 TXIE_bit            _BIT_ACCESS(PIE1,4)
// PIR1<TXIF>
extern volatile __bit                   TXIF                __at(0x7CF4);	// @ (0xF9E * 8 + 4)
#define                                 TXIF_bit            _BIT_ACCESS(PIR1,4)
// DMACON1<TXINC>
extern volatile __bit                   TXINC               __at(0x7B05);	// @ (0xF60 * 8 + 5)
#define                                 TXINC_bit           _BIT_ACCESS(DMACON1,5)
// PMD3<TXMMD>
extern volatile __bit                   TXMMD               __at(0x778F);	// @ (0xEF1 * 8 + 7)
#define                                 TXMMD_bit           _BIT_ACCESS(PMD3,7)
// RPINR0_1<U1RXR0>
extern volatile __bit                   U1RXR0              __at(0x7150);	// @ (0xE2A * 8 + 0)
#define                                 U1RXR0_bit          _BIT_ACCESS(RPINR0_1,0)
// RPINR0_1<U1RXR1>
extern volatile __bit                   U1RXR1              __at(0x7151);	// @ (0xE2A * 8 + 1)
#define                                 U1RXR1_bit          _BIT_ACCESS(RPINR0_1,1)
// RPINR0_1<U1RXR2>
extern volatile __bit                   U1RXR2              __at(0x7152);	// @ (0xE2A * 8 + 2)
#define                                 U1RXR2_bit          _BIT_ACCESS(RPINR0_1,2)
// RPINR0_1<U1RXR3>
extern volatile __bit                   U1RXR3              __at(0x7153);	// @ (0xE2A * 8 + 3)
#define                                 U1RXR3_bit          _BIT_ACCESS(RPINR0_1,3)
// RPINR0_1<U1TXR0>
extern volatile __bit                   U1TXR0              __at(0x7154);	// @ (0xE2A * 8 + 4)
#define                                 U1TXR0_bit          _BIT_ACCESS(RPINR0_1,4)
// RPINR0_1<U1TXR1>
extern volatile __bit                   U1TXR1              __at(0x7155);	// @ (0xE2A * 8 + 5)
#define                                 U1TXR1_bit          _BIT_ACCESS(RPINR0_1,5)
// RPINR0_1<U1TXR2>
extern volatile __bit                   U1TXR2              __at(0x7156);	// @ (0xE2A * 8 + 6)
#define                                 U1TXR2_bit          _BIT_ACCESS(RPINR0_1,6)
// RPINR0_1<U1TXR3>
extern volatile __bit                   U1TXR3              __at(0x7157);	// @ (0xE2A * 8 + 7)
#define                                 U1TXR3_bit          _BIT_ACCESS(RPINR0_1,7)
// RPINR2_3<U2RXR0>
extern volatile __bit                   U2RXR0              __at(0x7158);	// @ (0xE2B * 8 + 0)
#define                                 U2RXR0_bit          _BIT_ACCESS(RPINR2_3,0)
// RPINR2_3<U2RXR1>
extern volatile __bit                   U2RXR1              __at(0x7159);	// @ (0xE2B * 8 + 1)
#define                                 U2RXR1_bit          _BIT_ACCESS(RPINR2_3,1)
// RPINR2_3<U2RXR2>
extern volatile __bit                   U2RXR2              __at(0x715A);	// @ (0xE2B * 8 + 2)
#define                                 U2RXR2_bit          _BIT_ACCESS(RPINR2_3,2)
// RPINR2_3<U2RXR3>
extern volatile __bit                   U2RXR3              __at(0x715B);	// @ (0xE2B * 8 + 3)
#define                                 U2RXR3_bit          _BIT_ACCESS(RPINR2_3,3)
// RPINR2_3<U2TXR0>
extern volatile __bit                   U2TXR0              __at(0x715C);	// @ (0xE2B * 8 + 4)
#define                                 U2TXR0_bit          _BIT_ACCESS(RPINR2_3,4)
// RPINR2_3<U2TXR1>
extern volatile __bit                   U2TXR1              __at(0x715D);	// @ (0xE2B * 8 + 5)
#define                                 U2TXR1_bit          _BIT_ACCESS(RPINR2_3,5)
// RPINR2_3<U2TXR2>
extern volatile __bit                   U2TXR2              __at(0x715E);	// @ (0xE2B * 8 + 6)
#define                                 U2TXR2_bit          _BIT_ACCESS(RPINR2_3,6)
// RPINR2_3<U2TXR3>
extern volatile __bit                   U2TXR3              __at(0x715F);	// @ (0xE2B * 8 + 7)
#define                                 U2TXR3_bit          _BIT_ACCESS(RPINR2_3,7)
// RPINR4_5<U3RXR0>
extern volatile __bit                   U3RXR0              __at(0x7160);	// @ (0xE2C * 8 + 0)
#define                                 U3RXR0_bit          _BIT_ACCESS(RPINR4_5,0)
// RPINR4_5<U3RXR1>
extern volatile __bit                   U3RXR1              __at(0x7161);	// @ (0xE2C * 8 + 1)
#define                                 U3RXR1_bit          _BIT_ACCESS(RPINR4_5,1)
// RPINR4_5<U3RXR2>
extern volatile __bit                   U3RXR2              __at(0x7162);	// @ (0xE2C * 8 + 2)
#define                                 U3RXR2_bit          _BIT_ACCESS(RPINR4_5,2)
// RPINR4_5<U3RXR3>
extern volatile __bit                   U3RXR3              __at(0x7163);	// @ (0xE2C * 8 + 3)
#define                                 U3RXR3_bit          _BIT_ACCESS(RPINR4_5,3)
// RPINR4_5<U3TXR0>
extern volatile __bit                   U3TXR0              __at(0x7164);	// @ (0xE2C * 8 + 4)
#define                                 U3TXR0_bit          _BIT_ACCESS(RPINR4_5,4)
// RPINR4_5<U3TXR1>
extern volatile __bit                   U3TXR1              __at(0x7165);	// @ (0xE2C * 8 + 5)
#define                                 U3TXR1_bit          _BIT_ACCESS(RPINR4_5,5)
// RPINR4_5<U3TXR2>
extern volatile __bit                   U3TXR2              __at(0x7166);	// @ (0xE2C * 8 + 6)
#define                                 U3TXR2_bit          _BIT_ACCESS(RPINR4_5,6)
// RPINR4_5<U3TXR3>
extern volatile __bit                   U3TXR3              __at(0x7167);	// @ (0xE2C * 8 + 7)
#define                                 U3TXR3_bit          _BIT_ACCESS(RPINR4_5,7)
// RPINR6_7<U4RXR0>
extern volatile __bit                   U4RXR0              __at(0x7168);	// @ (0xE2D * 8 + 0)
#define                                 U4RXR0_bit          _BIT_ACCESS(RPINR6_7,0)
// RPINR6_7<U4RXR1>
extern volatile __bit                   U4RXR1              __at(0x7169);	// @ (0xE2D * 8 + 1)
#define                                 U4RXR1_bit          _BIT_ACCESS(RPINR6_7,1)
// RPINR6_7<U4RXR2>
extern volatile __bit                   U4RXR2              __at(0x716A);	// @ (0xE2D * 8 + 2)
#define                                 U4RXR2_bit          _BIT_ACCESS(RPINR6_7,2)
// RPINR6_7<U4RXR3>
extern volatile __bit                   U4RXR3              __at(0x716B);	// @ (0xE2D * 8 + 3)
#define                                 U4RXR3_bit          _BIT_ACCESS(RPINR6_7,3)
// RPINR6_7<U4TXR0>
extern volatile __bit                   U4TXR0              __at(0x716C);	// @ (0xE2D * 8 + 4)
#define                                 U4TXR0_bit          _BIT_ACCESS(RPINR6_7,4)
// RPINR6_7<U4TXR1>
extern volatile __bit                   U4TXR1              __at(0x716D);	// @ (0xE2D * 8 + 5)
#define                                 U4TXR1_bit          _BIT_ACCESS(RPINR6_7,5)
// RPINR6_7<U4TXR2>
extern volatile __bit                   U4TXR2              __at(0x716E);	// @ (0xE2D * 8 + 6)
#define                                 U4TXR2_bit          _BIT_ACCESS(RPINR6_7,6)
// RPINR6_7<U4TXR3>
extern volatile __bit                   U4TXR3              __at(0x716F);	// @ (0xE2D * 8 + 7)
#define                                 U4TXR3_bit          _BIT_ACCESS(RPINR6_7,7)
// SSP1STAT<UA1>
extern volatile __bit                   UA1                 __at(0x7E39);	// @ (0xFC7 * 8 + 1)
#define                                 UA1_bit             _BIT_ACCESS(SSP1STAT,1)
// SSP2STAT<UA2>
extern volatile __bit                   UA2                 __at(0x78D1);	// @ (0xF1A * 8 + 1)
#define                                 UA2_bit             _BIT_ACCESS(SSP2STAT,1)
// PMD1<UART1MD>
extern volatile __bit                   UART1MD             __at(0x779A);	// @ (0xEF3 * 8 + 2)
#define                                 UART1MD_bit         _BIT_ACCESS(PMD1,2)
// PMD1<UART2MD>
extern volatile __bit                   UART2MD             __at(0x779B);	// @ (0xEF3 * 8 + 3)
#define                                 UART2MD_bit         _BIT_ACCESS(PMD1,3)
// PMD1<UART3MD>
extern volatile __bit                   UART3MD             __at(0x779C);	// @ (0xEF3 * 8 + 4)
#define                                 UART3MD_bit         _BIT_ACCESS(PMD1,4)
// PMD1<UART4MD>
extern volatile __bit                   UART4MD             __at(0x779D);	// @ (0xEF3 * 8 + 5)
#define                                 UART4MD_bit         _BIT_ACCESS(PMD1,5)
// UIE<UERRIE>
extern volatile __bit                   UERRIE              __at(0x7081);	// @ (0xE10 * 8 + 1)
#define                                 UERRIE_bit          _BIT_ACCESS(UIE,1)
// UIR<UERRIF>
extern volatile __bit                   UERRIF              __at(0x7BC1);	// @ (0xF78 * 8 + 1)
#define                                 UERRIF_bit          _BIT_ACCESS(UIR,1)
// DSCONL<ULPWDIS>
extern volatile __bit                   ULPWDIS             __at(0x7942);	// @ (0xF28 * 8 + 2)
#define                                 ULPWDIS_bit         _BIT_ACCESS(DSCONL,2)
// PORTA<ULPWUIN>
extern volatile __bit                   ULPWUIN             __at(0x7C00);	// @ (0xF80 * 8 + 0)
#define                                 ULPWUIN_bit         _BIT_ACCESS(PORTA,0)
// UCFG<UOEMON>
extern volatile __bit                   UOEMON              __at(0x708E);	// @ (0xE11 * 8 + 6)
#define                                 UOEMON_bit          _BIT_ACCESS(UCFG,6)
// UCFG<UPP0>
extern volatile __bit                   UPP0                __at(0x7088);	// @ (0xE11 * 8 + 0)
#define                                 UPP0_bit            _BIT_ACCESS(UCFG,0)
// UCFG<UPP1>
extern volatile __bit                   UPP1                __at(0x7089);	// @ (0xE11 * 8 + 1)
#define                                 UPP1_bit            _BIT_ACCESS(UCFG,1)
// UCFG<UPUEN>
extern volatile __bit                   UPUEN               __at(0x708C);	// @ (0xE11 * 8 + 4)
#define                                 UPUEN_bit           _BIT_ACCESS(UCFG,4)
// UIE<URSTIE>
extern volatile __bit                   URSTIE              __at(0x7080);	// @ (0xE10 * 8 + 0)
#define                                 URSTIE_bit          _BIT_ACCESS(UIE,0)
// UIR<URSTIF>
extern volatile __bit                   URSTIF              __at(0x7BC0);	// @ (0xF78 * 8 + 0)
#define                                 URSTIF_bit          _BIT_ACCESS(UIR,0)
// ODCON1<USART1OD>
extern volatile __bit                   USART1OD            __at(0x775A);	// @ (0xEEB * 8 + 2)
#define                                 USART1OD_bit        _BIT_ACCESS(ODCON1,2)
// ODCON1<USART2OD>
extern volatile __bit                   USART2OD            __at(0x775B);	// @ (0xEEB * 8 + 3)
#define                                 USART2OD_bit        _BIT_ACCESS(ODCON1,3)
// ODCON1<USART3OD>
extern volatile __bit                   USART3OD            __at(0x775C);	// @ (0xEEB * 8 + 4)
#define                                 USART3OD_bit        _BIT_ACCESS(ODCON1,4)
// ODCON1<USART4OD>
extern volatile __bit                   USART4OD            __at(0x775D);	// @ (0xEEB * 8 + 5)
#define                                 USART4OD_bit        _BIT_ACCESS(ODCON1,5)
// UCON<USBEN>
extern volatile __bit                   USBEN               __at(0x7BAB);	// @ (0xF75 * 8 + 3)
#define                                 USBEN_bit           _BIT_ACCESS(UCON,3)
// PIE2<USBIE>
extern volatile __bit                   USBIE               __at(0x7D04);	// @ (0xFA0 * 8 + 4)
#define                                 USBIE_bit           _BIT_ACCESS(PIE2,4)
// PIR2<USBIF>
extern volatile __bit                   USBIF               __at(0x7D0C);	// @ (0xFA1 * 8 + 4)
#define                                 USBIF_bit           _BIT_ACCESS(PIR2,4)
// IPR2<USBIP>
extern volatile __bit                   USBIP               __at(0x7D14);	// @ (0xFA2 * 8 + 4)
#define                                 USBIP_bit           _BIT_ACCESS(IPR2,4)
// PMD4<USBMD>
extern volatile __bit                   USBMD               __at(0x7784);	// @ (0xEF0 * 8 + 4)
#define                                 USBMD_bit           _BIT_ACCESS(PMD4,4)
// UCFG<UTEYE>
extern volatile __bit                   UTEYE               __at(0x708F);	// @ (0xE11 * 8 + 7)
#define                                 UTEYE_bit           _BIT_ACCESS(UCFG,7)
// UCFG<UTRDIS>
extern volatile __bit                   UTRDIS              __at(0x708B);	// @ (0xE11 * 8 + 3)
#define                                 UTRDIS_bit          _BIT_ACCESS(UCFG,3)
// RCON3<VBAT>
extern volatile __bit                   VBAT                __at(0x7BE0);	// @ (0xF7C * 8 + 0)
#define                                 VBAT_bit            _BIT_ACCESS(RCON3,0)
// ANCFG<VBG2EN>
extern volatile __bit                   VBG2EN              __at(0x7809);	// @ (0xF01 * 8 + 1)
#define                                 VBG2EN_bit          _BIT_ACCESS(ANCFG,1)
// ANCFG<VBG6EN>
extern volatile __bit                   VBG6EN              __at(0x780A);	// @ (0xF01 * 8 + 2)
#define                                 VBG6EN_bit          _BIT_ACCESS(ANCFG,2)
// ANCFG<VBGEN>
extern volatile __bit                   VBGEN               __at(0x7808);	// @ (0xF01 * 8 + 0)
#define                                 VBGEN_bit           _BIT_ACCESS(ANCFG,0)
// RCON3<VBPOR>
extern volatile __bit                   VBPOR               __at(0x7BE1);	// @ (0xF7C * 8 + 1)
#define                                 VBPOR_bit           _BIT_ACCESS(RCON3,1)
// RCON3<VDDBOR>
extern volatile __bit                   VDDBOR              __at(0x7BE3);	// @ (0xF7C * 8 + 3)
#define                                 VDDBOR_bit          _BIT_ACCESS(RCON3,3)
// RCON3<VDDPOR>
extern volatile __bit                   VDDPOR              __at(0x7BE2);	// @ (0xF7C * 8 + 2)
#define                                 VDDPOR_bit          _BIT_ACCESS(RCON3,2)
// HLVDCON<VDIRMAG>
extern volatile __bit                   VDIRMAG             __at(0x7D47);	// @ (0xFA8 * 8 + 7)
#define                                 VDIRMAG_bit         _BIT_ACCESS(HLVDCON,7)
// LCDREF<VLCD1PE>
extern volatile __bit                   VLCD1PE             __at(0x76B8);	// @ (0xED7 * 8 + 0)
#define                                 VLCD1PE_bit         _BIT_ACCESS(LCDREF,0)
// LCDREF<VLCD2PE>
extern volatile __bit                   VLCD2PE             __at(0x76B9);	// @ (0xED7 * 8 + 1)
#define                                 VLCD2PE_bit         _BIT_ACCESS(LCDREF,1)
// LCDREF<VLCD3PE>
extern volatile __bit                   VLCD3PE             __at(0x76BA);	// @ (0xED7 * 8 + 2)
#define                                 VLCD3PE_bit         _BIT_ACCESS(LCDREF,2)
// LCDPS<WA>
extern volatile __bit                   WA                  __at(0x76D4);	// @ (0xEDA * 8 + 4)
#define                                 WA_bit              _BIT_ACCESS(LCDPS,4)
// MEMCON<WAIT0>
extern volatile __bit                   WAIT0               __at(0x771C);	// @ (0xEE3 * 8 + 4)
#define                                 WAIT0_bit           _BIT_ACCESS(MEMCON,4)
// MEMCON<WAIT1>
extern volatile __bit                   WAIT1               __at(0x771D);	// @ (0xEE3 * 8 + 5)
#define                                 WAIT1_bit           _BIT_ACCESS(MEMCON,5)
// RTCVALH<WAITB0>
extern volatile __bit                   WAITB0              __at(0x7AEE);	// @ (0xF5D * 8 + 6)
#define                                 WAITB0_bit          _BIT_ACCESS(RTCVALH,6)
// RTCVALH<WAITB1>
extern volatile __bit                   WAITB1              __at(0x7AEF);	// @ (0xF5D * 8 + 7)
#define                                 WAITB1_bit          _BIT_ACCESS(RTCVALH,7)
// RTCVALH<WAITE0>
extern volatile __bit                   WAITE0              __at(0x7AE8);	// @ (0xF5D * 8 + 0)
#define                                 WAITE0_bit          _BIT_ACCESS(RTCVALH,0)
// RTCVALH<WAITE1>
extern volatile __bit                   WAITE1              __at(0x7AE9);	// @ (0xF5D * 8 + 1)
#define                                 WAITE1_bit          _BIT_ACCESS(RTCVALH,1)
// RTCVALH<WAITM0>
